{"What causes severe swelling and pain in the knees?": "3097310", "why don't they put parachutes underneath airplane seats?": "3910705", "how to clean alloy cylinder heads ?": "237390", "how do i get them whiter?": "2247892", "What is Cloud 9 and 7th Heaven?": "1078492", "How do you like your eggs?": "782453", "What is a conscience?": "3198658", "How do I get college money?": "1907320", "how can u tell when a person is tellin u a lie?": "10895", "How do you transfer voicemail messages onto tape?": "992730", "Why does PAMELA   ANDERSON ........NOT CARE about  Children?": "3486120", "what is the difference between a cigarette and a hand rolled joint?": "2305171", "What's a Taxi Medallion?": "3769487", "what is the meaning of \"nikita\"?": "2432710", "How do U get rid of corns on the toes?": "3116225", "Why is it that conservatives attack the critics personally, but progressives focus on the principles?": "3785043", "Why don't you ever see the headline \"Psychic Wins Lottery\"?": "2433622", "How to fade the Scar Mark of face appeared by Stitches?": "443147", "What is an Allantois?": "4359052", "How do you determine if something is considered common knowledge?": "3049682", "How about a bumper sticker thats says:?": "3884772", "my lil sis  owns a nokia 7650 her blue tooth doesn't work, how do i get it to work?": "802001", "Why would a child's psychologist recommend hospitalization to develop social skills?": "348777", "How and What court should I take a driver who damaged my liability insurance car?": "397709", "Why is every one so paranoid about nudity?": "3764889", "What does \"crunching numbers\" mean?": "1398838", "What do you consider is the most important when working with customers?": "1384464", "what is the best hangover cure and dont tell me \"Dont Drink\" that is the lamest way to cure hangovers help me!": "687186", "Why do we always close our eyes when we sneeze?": "1703147", "Why be an \"A:Theist ?": "1184520", "Why are there bad people in the world?": "262748", "What are the physical benefits of sex?": "2750940", "Why do people ignore global issues?": "2689609", "How did Eve dare to deny the order of God to get near to the tree of Knowledge?": "1021881", "how do u make pancakes?": "3044096", "How do I install LED's into my car?": "2466898", "How do i Precipitate gold from aqua regia solution by using reducing agent ferrous sulphate?": "1536562", "how do u no which came first the chicken or the ege?": "2902266", "how do we reach that poin of understanding between religions ?": "929174", "How to become a millionaire?": "2181797", "why we get irritate?": "2439070", "How Can you forge a doctors note?": "2380291", "Why do younger generations look down on Baby Boomers?": "2700496", "How do you safely wean a person off Risperidal?": "3083719", "what's the meaning of fax and voicemail?": "2457214", "How do you get rid of cellulite on your legs?": "1942515", "How should I prepare whale bones in order to get rid of flesh and have it ready for an exhibition standing?": "1404559", "Why is the earth's core hot?": "3555750", "Why does everone want a horse?": "2891885", "why do lawyers have such a bad reputation?": "903661", "What person from the Bible do you want to meet in paradise and why?": "3903273", "what hapens if i swollow my gum?": "2384614", "How do you get rid of the smell of vomit in a car?": "376888", "How to avoid saying \"ah\" while public speaking?": "1635574", "what was the actual reason for the war in Iraq?": "439645", "Why is it that we teach our children not to take candy from strangers?": "310429", "why one comes to yahoo answers frequently?": "3773700", "what is the Philosophy of Education?": "1600205", "why do fish died with open eyes?": "3538545", "why should i respect Christianity?": "982792", "Why Islamic countries poor and unstable?": "2185055", "How do you get rid of bad habits?": "329228", "how do i seperate hydrgen molacules from water?": "1293344", "Why aren't all of our soldiers in Iraq equipped with protective armored clothing?": "2228540", "What is the difference between a PUT and a CALL?": "3545837", "What do the following words mean in Russian?": "524318", "why do the nails get white spots?is it a lack of calcium?": "391008", "What if auto appraiser appraises car at lowervalue 2 repair damage?What if the auto shop of choice cost higher": "1536945", "Marry or Stay Single and why ?": "983847", "what is a radar?": "3312600", "do you know how to remove an email address to your email account?": "3491186", "What is ecstacy(the drug)?": "1095114", "How would a black hole affect a block of iron, say the size of a house, as its being pulled in the black hole?": "4205394", "why did small bunny is cute?": "1262366", "(i'm french)what is black friday?": "2516435", "What is 1 plus 1?": "2614708", "What is the life of a Black person today?": "2833026", "How can we eradicate racism?": "1851008", "what is a dugan?": "1803954", "why would chicks not be able to brake out of there eggs?": "2622369", "What exactly does agnostic mean?": "1025202", "What happens to Flick on the playground?": "2799828", "How can i get rid of cold sores?": "763227", "i cant playing the standard chess why?": "864474", "Why haven't Muslims protested the terrorism by radical Islam like they did the Cartoon Jihad?": "3752394", "Why is my MRSA Staph infection continuing to relapse?": "1717297", "why do we get bugger in our noses?": "2911750", "what is the D'vinci code?": "1878704", "how sun rises?": "1485589", "How does it work, when praying for a lost soul, to come to Jesus?": "2597856", "how are DNA and RNA similar?": "844617", "Why ARE GAS PRICES DIFFERENT AT GAS STATIONS OWNED BY THE SAME COMPANY BUT ONLY 2 MILES APART?": "4340915", "why do parakeets bounce up and down?": "4042061", "Why did Kerry call the soldiers dumb?": "4163097", "what is the real difference between prescription drugs and street drugs?": "1467530", "what's a unique/creative christmas gift for someone equally unique/creative?": "1835903", "Why do some people confuse \"believe in\" with \"worship\"?": "2342695", "What does cordon bleu mean?": "900313", "What is the purpose of stirring during refluxing?": "4168414", "How can I get rid of my stereotypical thinking?": "2095626", "How to make money on websites?": "4021207", "why foreigner girls are more attractive?": "1621157", "How can you get rid of Abscest infection on your gum?": "1610361", "Why don't cats need haircuts?": "949467", "How do I change the alternator on my 98' mustang?": "4429948", "why are we born and why do we die?": "1056431", "why my neighbor's dog doesn't bark?": "1158088", "why is guiness black?": "2060239", "Why are registered sex offenders demonized?": "2231431", "Why are Mormons, JW's and Protestant Christians the only religious groups that have ever pounded on my door?": "1257619", "why are american women so materialistic?": "639850", "What cookies do you like?": "2169181", "how do you view life?": "658382", "Why should I open a school in Dubai?": "637206", "What is hemorroides?": "2233493", "why did the egyptians make mummies but not daddies?": "931698", "Why does one of my 3 cats pee around the house (especially in clean clothes)?": "1630279", "what did a dodoburger taste like?": "708708", "how do i cook canned peas?": "892524", "Why won't Cingular let me use my Blackberry to access the Internet?": "625927", "Why does Sacha Baron Cohen in Borat not rip the pish out of Israel instead of kazakstan?": "351009", "why do Twinkies melt in boiling water?": "960791", "what is the difference between globalism and globalization?": "4142200", "How dumb does the affects of alcohol make you and how long does the effect last?": "1652767", "why do american history textbooks gloss overthe recent past?": "1216249", "If n x 0 = 0  Why can't n x 0 = n?": "2121009", "What is the reason for the war in IraQ?": "2728755", "Why do people tip crappie?15% do u know what that is?": "591004", "Why do some people treat retail store employees like they're personal servants?": "2526422", "Why do some humans enjoy the scent of their own flatulence?": "1605907", "Why is voting compulsory in Australia?": "1682582", "Altavista - what does it mean?": "3746156", "what is the meaning of the word \"Forensication\"?": "333758", "What is the best destination in Caribbean to visit and why?": "2494378", "How do/did you overcome giult when converting to a new religion?": "2227450", "Why is most of the world have to be dumbasses and smartasses and why can't they ever grow the f#%k up?": "2693916", "Why is the world becoming more and more corrupt?": "3089614", "IF Jimmy Hoffa is found on the farm, how will it change American culture?": "546552", "what is the speed of light & sound ?": "2078477", "What does North by North-West mean?": "1107012", "Why does my 1993 Grand Am GT overheat in traffic, blow cold air, then hot, & also overheats when idles?": "652392", "What is the cost of sanity?": "1961038", "What does \"chicken-head\" mean?": "2531145", "What is the difference between a well liquor and a call liquor?": "1401617", "How do I represent my own corporation in a lawsuit?": "2867623", "If the theory on creationism is true, why didn't noah save the dinosaurs?": "3518515", "Why doesn't the government introduce tolling on all motorways like they do in France?": "1081128", "Can someone explain how to properly use \"farther\" and \"further\" in a sentence?": "1781052", "How can I as a fifth grade teacher get parents more involved in the class?": "129987", "Why do liberals suck the life out of everything positive that happens in Iraq?": "2437022", "What can I do when my ignition key won't turn?": "2008456", "what does critical thinking mean to you?": "47501", "What are the purposes of windmills?": "2218058", "what is knee effusion?": "2875208", "what is the element symbol for oxygen and why?": "3114525", "how can u tell the size of a engine in a car?": "3914071", "why my dog keep throwing up?": "3769909", "how to change front disk on honda acoord 2002?": "4109641", "How do I remove tunes from my MP3?": "2602661", "Why Meditation made so unhappy?": "4048240", "what does parish mean?": "2577414", "what is the difference between area and perimeter?": "2983053", "How can I find what a company is through it's ein number?": "3280680", "how can i get rid of dark circles aroun my eyes?": "3340682", "what is the fine for driving without a seatbelt in california?": "2776561", "how will know if im pregnant?": "2776567", "why cant u keep your eyes open when u sneeze?": "830063", "Why don't they make cigarette flavored toothepaste?": "898834", "What is your favorite sound and why?": "1781331", "why does the people will get aids?": "2456114", "omens or signs what does 3 knocks on the door mean?": "3843095", "why are italians so skinny?": "1817549", "Why Italy is not considered in a lot of videogames?": "1328803", "does anybody know how to play halo2 on an xbox 360?": "2020534", "I know that fat is unhealthy,so why does my doctor say to eat nuts which are loaded with fat?": "3277946", "What is turkish delight?": "3298388", "Why  Christians confess?": "3766120", "Why are unidentified bodies called John/Jane Doe?": "2750024", "why does my cat lick iron?": "507671", "how were the first rulers made?": "1237311", "What is 'Beano'?": "4155136", "How do I receive e-mails in Japanese?": "3074368", "how can a person stay unbeaten at checkers?": "1464182", "what's the real purpose american invantion to Irak?": "4141236", "How to Spice up our lovemaking?": "4031702", "how does a jet moter work?": "4154956", "how do i fix a frozen ps2 without turning it off?": "3904844", "Why does vanadium conduct electricity at ordinary temperatures and pressures?": "1655655", "Why do we Americans support  Israel?": "2269042", "why does my cat slava when i stroke her?": "1487318", "Why do non-religious people celebrate christmas?": "3829664", "What is a simple way to check for a blown head-gasket?": "158155", "Why are the richest people the meanest people?": "616745", "in freezing wheather how do you get car doors open w/o tearing of the wheather stripping?": "3368329", "Why do Americans pronounce Van Gogh like \"Van Go\"?": "3197945", "Why do I grind my teeth in my sleep?": "3621164", "what is kinetis energy?": "3621161", "Why is their a teacher shortage?": "4117896", "i just got a kitten she is about 7 weeks what can i feed her?": "1019517", "What medical conditions is medicinal marijuana prescribed for?": "1097146", "how do i remove the nude patch  v1.0.0.1022 from the sims 2 game?": "4217473", "How do you get rid of a hickey in less than 24hrs?": "1498267", "Why and when indira gandhi got her surname GANDHI ?": "383909", "how do i knou that i'm gay?": "2946575", "how do People build mussels on there biceps?": "406082", "Why is suicide considered a sin?": "1708230", "What is a pleural effusion?": "1550212", "how do i measure 5 grams of Creatine?": "2131177", "How do Blackberry's recognize that they are in their holster?": "1321784", "What do you sleep on?": "1426018", "how to loose wait without exercise?": "1708787", "How bad do you have to be to go to hell?": "1258084", "how to be thin?": "4424796", "Why do girls thinks there fat?": "4043037", "What do i do about not wanting to sleep at night?": "1051695", "What is the reason of condom breaking?": "2061975", "How do motorcycle remains upright and stable by gyroscopic forces.In detail] ..pls?": "1881436", "What do I do if, Mom Cat still in labor, won't nurse baby's?": "3240573", "How or why was the custom of serving a salad before a meal started?": "1680635", "If someone sends you an email that says something to the nature of how sexy you are, is that a turn on or off?": "2992609", "how accurate are pet psychics?": "2233950", "I dont know what to do?": "2261458", "How can you tell if yeast is good before using it?": "1860504", "Why is the candy bar called a Butterfinger when there is no butter or fingers in it?": "1056653", "why must i sleep with my eyes closed?": "2528361", "How do you slow down an electric meter?": "2452131", "Why are 'human rights' groups so obsessed with Israel and USA?": "844842", "What does O'Rilley mean by the term No Spin Zone?": "3991428", "what happens to bees in the winter time?": "1308733", "?How can i  clean my bedroom with out spending  bunch of hours?": "1356733", "what is 7-(34x5)-20+400-82+290= ?": "1476791", "how do i lower  my whit  blood cell count?": "1635541", "Why do all of the deeply insightful questions get ignored, while the superficial or rhetorical ones do not?": "4018311", "Why isn't there any military bases in the state of Mississippi?": "514804", "what is the definition of schizophernia?": "488316", "how to kiss?": "235775", "How do i burn music from my limewire library just using a laptop, and without paying for limewire pro>?": "262642", "What is your take on the Da Vinci Code?": "1847644", "Why are Indians called Indians?": "1958375", "Why is my wang so enormous?": "1450678", "what scares you most and why?": "3346105", "Can you tell how stupid someone is just by reading something they have written?": "4115042", "why is there a chicken on the cornflakes box?": "323517", "why wont people email me?": "2387399", "If the econ is so great why is the savings rate negative?": "1925984", "why is the study of human anatomy and physiology important?": "3060307", "Why are people camping out to get a PS3?": "3017307", "What are quantum physics anyway?": "1520491", "why do we sleep lying down?": "1375278", "How would the world be different today if the Holocaust never happened?": "1895467", "What is the dumbest question you've answered?": "1272654", "what is noise pollution...i need a scientist?": "2353050", "What is the difference between a Masala Dosa and a Rawa Dosa?": "1599582", "How can I be a Jesus disciple?": "95544", "what is the cause of my vagina dryness and what is the remedy?": "506454", "why was  wearing the colour green considered a sign of madness?": "763189", "How can I get rid of a sinus infection without medication?": "3124162", "What would happen to the fragile housing market if a lot of undocumented workers were deported?": "1475681", "Why do Catholics have to go to Priest to confess and recieve a punishment like saying \"Hail Mary\" a bunch of-": "894780", "Why isn't regular water sold in cans like soda and juice?": "4166975", "Why should I read Wittgenstein?": "3084868", "How do you stop bad feelings toward the people ?": "2858043", "what is difference between civil judgement and a normal judgement?": "2614712", "what holiday is tomorrow?": "1005057", "How can I prevent my ice cubes from tasting like other food in the freezer?": "1437381", "why do some people say Jeuse wasnt White?": "2161729", "What does social class have to do with crime?": "481641", "why does my bark all the time?": "2230158", "Can you remember how you heard the Princess Dianna had been killed?": "3302263", "What year(s) is a ford escort transmission the same as a 1998 Mazda 1.5 liter protege transmission ?": "969778", "Why do people say god-bless you when somone sneezes?": "850911", "What does it mean when your check engine light comes on?": "2415052", "What is the meaning of life the Universe and everything?": "1410924", "How come girls don't play video games?": "1507137", "how can you tell why chickens are losing feathers..?": "3857203", "what is Pan German nationalism?": "2681006", "what is the  reason behind dog's being 'locked up' during  mating?why do they can't seperate?": "247257", "Why is there no perfect diet?": "46875", "Why does the volume of a channel increase when commercials are aired?": "2612490", "how will u celebrate ure quincenera?": "808428", "Why do i get tired eyes(sleepy) when i read a book?": "2197713", "Suppose that black hole is what forms a star?Then black hole wouldnt come from stars?How do we know?": "2594370", "How do you go to sleep faster without taking sleeping pills?": "3846559", "how can i get my cat to stop drinking the fish tank water?": "285233", "How to stop hating the world around me?": "773826", "How do you get rid of itchy, watery eyes?": "668422", "In the constellation Lyra, why are some of the stars labeled with the Roman alphabet?": "884643", "how do yooh laugh?": "3617468", "whats ur favourit yugioh mmonster and why?": "2400470", "What do I do about preaching christian friend?": "2209503", "How is voting for the Democrats a vote for terrorists?": "3613748", "WHY is it the people on here?": "4091687", "How can i stop seeing a little girl whom i believe is a ghost in my room before i go to sleep?": "3247012", "How do u clean a gas tank to a bike?": "3975174", "why is the number 13 unlucky ?": "4078052", "how do i get the cat to stop using the bathroom in my room?": "4000671", "what is intrapreneurship?": "911954", "Why do people get so worked up over religious/moral questions?": "3788531", "Why does my schnauzer lick me almost constantly?": "2394635", "Why do we say, \"God bless you\" when someone sneezes?": "4237144", "Why do u feel very sleepy when u have an exam coming up and why u do not get sleepy after u have finished it?": "1534148", "How soon after the big bang did outer space turn black?": "4122089", "Why does the water stink in my fish tank?": "1588055", "How do u become fat..can anybody tell me?": "2355586", "If Adam and Eve had 2 sons, how did life continue?": "3789758", "How important is a person's individual life?": "4246480", "What is the difference between these two lists of words?": "4352937", "Why materialism destroy us?": "4241596", "What can you do if you have a warranty issue and cannot find the receipt?": "1859476", "why do men sulk when you dont give the correct answer to them?": "162932", "What is a gentleman?": "3213735", "how do i get a replacement key of my 1997 nissan maxima?": "4472543", "How to get rid of hiccups?": "85663", "what do they mean by \"pork barrel spending\" ?": "964461", "What is a c-section?": "1467389", "What do the different color of Mcdonald shirts on the  employees mean?": "4250214", "Is there a difference between how Trent Lott and John Kerry were treated with their \"misspeaking\" experiences?": "1270258", "If frog legs taste like chicken, why do people eat it when chicken is cheaper?,?": "257403", "what is the answer 6m+5=47?": "3547216", "why do human beeing hv to belive in god ?": "58338", "why dont pepole take us blonds seruiusly anymore it not like where dumb we just have our blond moments?": "1905749", "How early did you start masturbating?": "2271886", "Why did Pope John Paul II tell Stephen Hawking not to study the origin of universe?": "1451853", "why do not sun attract earth?": "2817149", "what is caffeines effect on plant growth?": "1928925", "What does the word Padre mean in english?": "884731", "what are some reasons for illegal immigration?": "3665285", "if god is real then why does he hide?": "2613725", "how do you get rid of a headache with out medicine?": "1763", "what could be the cause of pain below the belly button?": "3122739", "How come everbody assumes humpty dumpty was an egg?": "1123407", "why pigeons have the ability to comeback home?": "2441987", "If dreams seem soo real, then how do we know what's a dream and what's real?": "4269226", "What are the importance of Cakes in different occasions?": "3535910", "Why are they so negtive?": "3415459", "what is a diruetic?": "1639607", "What Does Global Warming mean to you?": "4261150", "what does an executioner put on his resume?": "3082557", "Why do liberals refuse to accept logic/facts and only rely on emotion in arguments?": "1857875", "Why Do People Have An Aversion To Me?": "823058", "How to tighten a screw?": "3750939", "What is the main difference between being self employed and consulting?": "152350", "why shoot birds ?": "992626", "why are strawberries red?": "868661", "why does my female cat spray when she has been spayed?": "3805489", "what is the meaning of the words engulf and sarcastically?": "2341219", "How do I find the integral of an absolute value?": "3318849", "How to run mile without stopping?": "3082950", "Why does Coke taste different depending on what country it is made?": "3927543", "What does \"shpeal\" mean?": "1105182", "what does Ester day mean?": "3766451", "what is the solution for children to avoid watching T.V?": "681911", "how can i make my thighs thicker?": "2237448", "Why does the it seem the U.S. has more serial killers than other countries?": "66151", "What is a radical aneurysm?": "2118274", "How do you study for a test in one night when you have 6 pages of notes to study for?": "2160415", "What is the first step to getting your driving permit?": "1807629", "how can i have wide curvy hips?": "144514", "how start investing money?": "400393", "what is dark energy?": "1144768", "How can bird's fly and we can't?": "637866", "what does my name mean by the way its nelly?": "3116977", "What do the numbers on skyscraper helipads mean?": "2342618", "How do you get rid of snakes coming inside the house?": "1239473", "what is a talipia?": "4127969", "How is the Earths magnetic field generated?": "562652", "What is a hydrocarbon?": "437974", "what does salt in rituals mean?": "1953582", "what is the difference b/n federal lavel and state lavel?": "291505", "How to become smart?": "1097878", "What is it that causes you to sneeze?": "2982426", "Why doesn't the world speak the language of god, English ?": "2806118", "How do you do a three was call?": "244918", "how to get rid of heachaches without taking any medicines?": "3715913", "If seven eleven is open 24 Hrs a day,  why do they have locks on the doors?": "3881840", "Why do my dog tags leave a green mark around my neck?": "4270694", "I need a creative suggestion on how to encourage my cosmetology students to show up to class on time?": "2803617", "Why do people answer simple math questions for people?": "245241", "Why do some people refer to the IRS as Uncle Sam?": "2357505", "I woke up this morning and my eyelid is swollen, what is it and how do I get rid of it?": "3305995", "How do you get rid of the light on the dashboard?": "835544", "How to stop the war in Iraq?": "1784177", "What is the sqare root of -16?": "3922248", "why would people choose to become mentally ill?": "4152728", "briefly explain why the apostle were vital to christianity?": "4361251", "Why is Tim Hortons coffee soooo good?": "2509052", "What does chromatography mean and what is a colloid?": "1372457", "How do you get candle wax off a crochet doilie?": "165026", "Why \"Break a leg\"  means good luck?": "631188", "where did the term \"god bless you\" after sneezing originate... and why?": "4318713", "What does PAGAN actually mean?": "2965678", "why do we have boogers?": "599291", "What is the sqaure root of pi?": "710436", "What is the meaning of grave blankets ?": "1322410", "How do you kill Sims effectively?": "3083178", "Why did Elie Wiesel choose \"Night\" as his title for his memoir?": "2934371", "Why do female dogs fight?": "1538829", "Why are teenagers, so looked down upon?": "400195", "how to make chlorates from sulpuric acid , caustic soda & sod.hypochlorite?": "1395494", "What can be done to check the spread of AIDS among Taxi drivers?": "1392114", "What's the difference between a hill and a mountain?": "2434087", "How do I prevent bamboo skewers from burning?": "4124112", "What quality of which is inherently contained in the question why?": "2546730", "Why are black people racist?": "3381250", "how can we stop pre-ejeculation?": "978626", "How do you re-heat Egg drop soup from a chinese restraunt?": "3139968", "why do african americans eat fried fish on fridays?": "3569462", "how can you tell if you have a bad keg?": "98662", "define the term specialised cell?": "1588783", "what are lithospheric plates?": "2157311", "how come my moma doesent know what  30+4 is?": "2112535", "How can I prevent getting little bumps after tanning?": "2233942", "how come some bibles translations dont use the original yahwey (jehova) in reference to god?": "3465597", "why is my gold fish not swimmimg?": "2899230", "What is sexual stamina?": "952062", "What is the weight difference between 68 lbs and 12 lbs 8 ounces?": "3575718", "What scientific studies have addressed marijuana use?": "3938405", "what is crystal methaphine?": "2458380", "Why do people still wave the confederate flag?": "3653952", "What works on getting getting rid of cat pee smell in my carpet?": "1537542", "Why do wet dreams stop and how can you get them back?": "2248876", "Why do we have turkey on Thanksgiving?": "4437026", "What is the theory that describes how living things change with time?": "3558585", "what is crude oil all about?": "1175152", "How can I find the earnings of a privately owned corporation?": "894023", "Why is it called INTERNATIONAL House of Pancakes?": "1717888", "what happens to bile salts when gallbladder has been removed?": "2587810", "what is macular degeneration?": "1059361", "what does it man when someone cherry is popped,what does it look like?": "1102885", "what is the least common multiple of 45 and 800?": "2962438", "what is the difference between MORAL & MORALITY?": "2762609", "what are u doing for Easter?": "2190298", "Why is my life so great?": "2055736", "Why are hiccups so hard to get rid of?": "1878166", "What does the passage \"the joy of the lord is my strength\" mean to you?": "2449050", "how do you heal from an affair?": "520351", "What are the chances of a tooth abscess?": "3738948", "what is a death angel?": "219853", "Why are there no lightning bugs in Southern California?": "372324", "Why do I have to answer all these Questions?": "4078949", "what is your conception to the 'Origin of Man..Biblical,Darwinian or the possibility of extraterestrials?": "514059", "what are we humans actually doing?": "3068034", "how can sexual desire be overcome?": "3913653", "How would YOU define a good job?": "3623798", "What is the purpose of running a fever?": "4336509", "how do you get to heaven?": "3497834", "How do I clean old allow car wheels?": "1501466", "Why did M&Ms only come in dark chocolate for a limited time?": "2408302", "How do you use a soldering tool?": "3537989", "why does my 1 yr dog dog scratch al the time?": "1938725", "How do I search dog registration tag numbers for a dog that I found?": "4214800", "What is the difference between dressing and stuffing?": "772988", "how is it being you?": "4338583", "How did Constantinople  become the capital of the Roman Empire and what are it's geographic advantages?": "1705428", "Why does it seem to storm almost only at night?": "550109", "How can i stop my partner being jealous?": "626602", "how tight to tighten the rocker arms and head on3.1 chevy lumina car?": "1013296", "What makes a great and engaging speech ?": "3537859", "how to get a higher attention span?": "3077638", "what are cell lines and a monolayer?": "1225605", "Why are liberals pretending to disapprove of and oppose Vladimir Putin's totalitarian consolidation of power?": "3358269", "What happened to Vanilla Coke?": "3068149", "why does sublingual mean?": "888605", "How to become a millioniare?": "1076769", "what is dry farming?": "4203546", "Why is my English bulldog scared of the broom, mop, and vacum?": "2847826", "Why is \"pie\" as in the math pie, used in finding the area of a circle?": "437418", "Why is the measure 'pound' abbreviated as lb?": "1925281", "What is the difference between customer and consumer?": "196651", "Im a teen, How can I grow taller quickly?": "2905116", "sore eyes from contacts.... what should i do?": "3970530", "why do the English act snobby?": "2390785", "Why do people use the epithet G-d?": "3710170", "how am i improve my English listening & speaking power?": "2648245", "why does a turtle go slow?": "1212269", "What is the difference if any between a prophet a psychic or a spiritual medium?": "4057520", "How do i cash money orders in the u.k i'm on holiday without an account?": "2454282", "What is Pantheism?": "2468788", "whats the difference between an enemy combatant and a pow?": "1389619", "Why do we fold our clothes?": "37377", "why do tragedies happen to some?": "521407", "Anybody know a guaranteed overnight way of getting rid of zits?": "2765527", "Why is Marijuana Illegal in the US?": "1759521", "What Is the Weather Like in Your Area?": "1701183", "why do we have to eat 3 times a day?": "1318456", "What's the difference between a university and a college?": "334906", "How sad - what does it mean when...?": "3853321", "how do i install A dvd player in my car to connect with my in dash cd player?": "2817688", "A hydrogen ion, H+, is the same as a(n).....(multiple choices listed in detail portion)?": "2906009", "Threw my shoe at Tom Cruise at the theater, when watching MI:3, why did i do that?": "2339601", "why doesn't space have daytime?": "1546463", "how does a fly land on a ceiling when it flies with legs facing down?": "565308", "How do you pronounce the name of Bast, the Egyptian cat goddess?": "2760902", "how do you get rich?": "3313253", "what is a hostal work environment?": "793065", "what does a platelet do?": "2515012", "Why is prostitution wrong?": "3407617", "How do I build a free website about a dog and to sell their puppies?": "2355802", "How do you stop a sister from being overweight if she wont stop eating or not listen to you?": "3008138", "How do you stop a cat from grabbing your leg sometimes biting and running off?": "3451722", "What is the difference between music and sound?": "2402930", "why are there still racists?": "3942470", "Why do people say \"save the earth\"?": "2494154", "Why do i have dark aureolas around my breasts?Why does that happen to women of light skin complexion?": "84498", "bulldog is aware of whats happening and trying to stop it, already at vet just waiting for blood work, ears fi": "3731489", "What is anatidaephobia?": "1749225", "How do I have to shave so that my face doesn't bleed a lot?": "2322471", "Why do teens today find it amusing to tear one another apart?": "2550445", "Why does chocolate make my kid throw tantrums?": "157907", "what is the purpose of \"The Allegory of the Cave\" by Plato?": "1223676", "Why is our galaxy(Milky Way) spiral?": "3995844", "how do I find the walla walla county, Walla walla, Washington jail roster page?": "3864422", "Why do students have to take gym class?": "284681", "why do we import so much oil when we have unused reserves in the U.S.?": "1194269", "Why do some people take political/ economic debate personally?": "132256", "does crickets chriping durring the weather change ?": "3547685", "Does anybony know how i can become a club promoter?": "1388368", "what is tautomerism?": "3536922", "how do I get my horse to square?": "2947942", "How will history treat President George W. Bush?": "2746440", "Why does my cat pee in the tub and how can I change his behavior?": "1461700", "Why did God create marijuana?": "1021396", "how to increase masculinity?": "3108265", "what r is the toughest questions to answer in an interview?": "229537", "What are the silent sins?": "2256847", "how can i make something out of nothing?": "637007", "How do you destroy a fish?": "2573999", "why does eating meat make me sick?": "3033478", "how can you keep a cat from climbing your christmas tree?": "3573609", "what is the purpose of bone cell ?": "1298837", "why is my fish tank cloudy?": "3867850", "tell me the difference between revenge and vengeance?": "3507499", "Why are the atmospheres of Venus and Earth so different?": "1953005", "what is online advertising?": "4314481", "how are ccharm quarks seen?": "3561365", "How and what can I do to make my girl climax?": "4317709", "What is philately?": "3629548", "How do you make a Nuclear Warhead?": "365195", "what does 'someone is walking on your grave' mean?": "598180", "Why sex is necessary for male and female?": "1648681", "What are my rights if the seller does not meet the deadline for closing on a home being purchased?": "3926737", "how do you find info about a house's history that isn't \"historical\"?": "1443637", "why do more people see a total lunar eclipse than a total solar eclipse?": "2558930", "how to carve barney rubble outta wood?": "4102868", "how do i shoot good black and white photographs?": "1517422", "How do I contact the Mormon church for f copy of a baptismal record?": "4480092", "How do mermaids have sexual intercourse?": "928429", "If you were granted 3 wishes, what would they be and why?": "3157650", "What is the biggest reason the rest of the world hates the USA?": "845209", "What is a 7th day Adventist?": "407830", "why natural gas has a smell added to it before it is supplied to customer?": "1232695", "why human is alone?": "3306888", "why does excrement smell so bad, and why is it a brown or dark colour?": "1254719", "how can we reduce differences between opposite sex?": "464026", "What's the difference between  a bond and a stock?": "19164", "What happens to a short position when the company goes bankrupt?": "847194", "how do I pronounce precocious?": "1165519", "how does masturbation work?": "409839", "If you where a super hero, what would your power be, and why?": "1578718", "How did 'poo' get into my bath?": "4238933", "How can a short nerdy looking  male around 5'5'' remain dominate(macho) but not passive in a society?": "3112242", "i have a 98 ford escort and when i  get to about 30mph it sounds like an airplane , what is it?": "2640621", "Creative way to make mashed potatoes?": "3291162", "What does the saying \"below the belt\" mean?": "4436327", "What is your favourite pizza topping and why?": "398865", "If human evolved from apes, why are there still apes and why dont they evolve too?": "3062728", "why we shiver while urinating ?": "400183", "Why is it that the more I love someone, the more I can be angry at that person for doing something stupid?": "1774657", "what are the fundamental human talents?": "3408666", "why dont white people work in the hot sun like mexicans?why dont they want mexicans if they do the job?": "601671", "why do we have hormonal changes in our body?": "1465357", "Why is a wishbone on a chicken called a wishbone?": "3808142", "how come cows can get wet but leather can't?": "2624723", "Why does racism only work one way?": "904093", "What form of divination do you prefer, and why?": "889718", "Why do people get so obsessed with what type of underwear a person wears?": "2198424", "what is a carpool?": "2915880", "What does KOed mean?": "2405364", "What is the difference between grammar and mechanics?": "3529099", "How come when the gas?": "2524394", "why do white people ALWAYS INSULT THIER OWN LOOKS AND race?": "1679440", "What does respect mean to you?": "1036718", "What is the purpose of heaven, say you got there already & eternity is yours... now what?": "2310879", "Where can I find a simplified explanation of how to use commas properly?": "98438", "what is the make of Alfa Romeo?": "88316", "Why does the bible leave out the existance of Adam's first wife?": "1190518", "Why do People talk in there Sleep ?": "966622", "what is the ideal age for baby to put in the stroller?": "25383", "how do i get a girl that cuts herself to stop?": "4232405", "Why have Nancy Pelosi and John Kerry gone into hiding?": "1051943", "How can you determine if a Galvanize Iron wire .is US Made?": "978522", "How do I get my GP to prescribe Ritalin for me?": "2528817", "How is Bali as a honeymoon destination as compared to Phuket?": "2770978", "what are emulsions...?": "2194276", "why are green beans green?": "3817905", "Why its acceptable for a man to practice polygamy , why women are condemn when their practice polygamy?": "3058642", "Why is Houston pronounced as if there were a y after the H?": "4392357", "What are the chances of getting dry socket 4 days after a wisdom tooth removal?": "1136380", "how to keep dogs free from ticks and flea?": "4260072", "Why hamsters run on an exercise wheel?": "1969597", "how do you clean a gas grill that has enamel coated grates?": "3513196", "Why do females answer men's health questions?": "2353070", "Why do people immigrant illegally?": "3220283", "HOW do you cure your migraines?": "3778422", "how do i change the rear brakes on a kawasaki klt 250?": "2779210", "Why aren't there ever any guilty bystanders?": "4048305", "How do i find out where somebody lives by just their license plate?": "2147299", "If i had a bad breath,what should i do?": "3738877", "whats the difference between agnostic beliefs, and atheistic beliefs?": "1442819", "How can you reduce hangovers?": "732200", "what causes constipation?": "1747254", "how can i get rid off hiccups?": "3383242", "how do i get rid of  this habit of  daydreaming?": "455362", "What is the best solution for unwanted baby cases?": "2201497", "does anyone know how to get rid of stray cats?": "299182", "how did the mexican people come to be?": "1552822", "Why do whores sweat in church?": "2040975", "What are the media's effects on girls' body image?": "679037", "What is the cheapest way to send packages?": "3364692", "why could my car be jumping forward when i ease up the clutch?": "2340636", "How do i save money?": "1035548", "How Do I Start A Mafia?": "1157215", "what does the term \"sexualy active\" mean?": "975584", "How can peace reign the world?": "3045976", "why do we have war rules?": "3708274", "how to remove an Order of Protection in New York state legally?": "3554411", "How to make a pimple ready to pop?": "867900", "What is the problem if changing the oil i find coolant?": "1114974", "How do you measure a TV?": "3431441", "why do people get hit by parked cars?": "1191246", "what is humans purpose in earth?": "3065195", "Why does my congregation complain about lenght of my  90 minute sermons ?": "461995", "Why do Americans seem determined to divide the nation over partisan politics?": "4121736", "Why is America so rich?": "3194750", "How can  change from being a night owl to a morning person?": "3067105", "Why is being gay so bad?": "2795247", "why do yanks call a chocolate bar a candy bar?": "1548552", "Why when someone is deaf and blind did they also call them dumb?": "3171095", "how do i get there from here?": "1606470", "What is the definition of customer service&?": "2231667", "What is the purpose of sealing new tile and terrazo?": "1772508", "Why do we have to wear green to avoid getting pinched on St. Patricks Day?": "226048", "How can I be more assertive without being DEFENSIVE?": "3643580", "i have a nokia 3230,how do i get the dust from under the screen,only 6mths old?": "3164341", "Why can we not see our soul?": "4160245", "How do you deal with depression?": "1279069", "what is personification?": "2967387", "what is smaller than a cell?": "2920776", "what are caskets its so amazing how they are made?": "566364", "what is cocciclusters?": "2539683", "How does Kriss kringle work?": "2316775", "On the most fundamental level, why is killing other humans bad?": "2632334", "How do us Australians Treat Asylum Seekers?": "3124638", "what is a health risk with african american soul food ...what meat has been substituted?": "1858655", "What is \"showerhead\"?": "2207146", "What is mariguana and how does it affect the human body?": "3059341", "How can i ejaculate harder?": "971642", "how can I be asuccessful engineer?": "2650160", "what is endometriousus?": "459726", "how can i see the world cup match in germany without any difficulty?": "4221552", "Eggs?How do you know if an egg has gone off ?": "3917891", "Why did you choose your screen name?": "1446468", "I've just opened my last beer, what will I do now?": "475108", "what is the green dot prepaid mastercard?": "2079139", "What does OAL mean in legal terms?": "3057034", "How do you become a concert pianist?": "2144267", "Why is it not raining in summer?": "917465", "if one has a serious question, then why do idiots respond?": "1045758", "how to improve brest size?": "3451737", "how to reject a friend without loosing him..?": "1049660", "Why are Mexicans the only immigrants people notice?": "4145856", "how to send a cv for applyng for a job?": "2294287", "can someone tell me how a contemplative life is the happiest, and what does that mean?": "1863881", "What is the most imortant battle in history and why?": "3218142", "Why do you pronounce HEAT and HEAD differently?": "866113", "what is right and what is wronge?": "2329735", "what affects did watergate have on the presidency?": "263783", "what is a transcendental universalist?": "3122193", "Why do more people answer questions related to sex and love and less people answer questions on education etc?": "2334873", "How and Why did the Roman Empire Fell Apart?": "511835", "How do i convince my parents to let me go clubbing?": "2603872", "What is Holocaust and what is Palestine murderer?": "2797128", "Why do some Christians believe the Bible to be Gods own words?": "2838825", "what is the lifespan of human being?": "2333538", "Why is it all about the money?": "2189216", "How did memory of a human brain expanded?": "3400018", "How do I repair a HID ballast?": "1364992", "What is Wheat Germ?": "4301004", "why do some gay men lisp?": "2825408", "How to take apart two (stuck) wet pint glasses without breaking either?": "47829", "what are the causes for the labour turnover?": "4468822", "What effect did the US withdrawal from S. Vietnam have on southeast Asia?": "144579", "What is the best national park to visit and why?": "2692614", "Why do i black out while i am driving ?": "913424", "Why, when the alarm goes off  you could sleep and sleep, but when you don't have to get up, you wake early?": "4086364", "Immigrants why dont they speak english?": "3588253", "how do you make a homemade battery?": "1200061", "Why has 80's fashion started to make a comeback?": "3812084", "why precisely is foreign food considered ethnic?": "103298", "what is meant by taxes?": "303179", "How  did you do ,when there  was a bomb  while  you were  shopping  in  New York ?": "752633", "What is the difference between a midget and a dwarf?": "513871", "Why do potato boils faster if we add salt in the water in which it is boiled?": "4269056", "Why do the British Hate the French?": "4156458", "what emotion do you have difficulty expressing?": "2379639", "why do people hang shoes from powerlines?": "2574647", "Why is it called common sense when it is so uncommon?": "319022", "what is the best way to get rid of hemorrhoid's?": "188661", "how was the modern temple of India built?": "2811912", "What's the best book to teach how to paint fur and feathers?": "1318155", "how can i tell if i have sunburn?": "3008679", "How to put together short and simple animation?": "1023093", "What is the purpose of the worm in nature?": "3128632", "why every clock in shop is adjusted as 10:10?": "3206528", "How to get over the loss of my friend?": "4043640", "why does my cat attack my feet?": "4038667", "How do I ace my math test?": "3807661", "Ok so why?": "2495991", "Which is better, sushi (raw fish on rice) or sashimi (plain raw fish) and why?": "3589442", "Why is dark chocolate better than milk chocolate, when they both have the same calorie and fat values?": "1960083", "My bike has consantly been giving low mileage... what cud be the problem?": "1638530", "What does it mean to repent?": "912062", "what to do if you have been with ya boyfriend 8yrs & he wont marry?": "764472", "Why is it harder for a man to aim when he urinates after he had sex?": "2297705", "how do i get rid of the smell of smoke?": "2062564", "how do i find a news artical from 1989?": "3458351", "Why does sticking your finger in soda fizz make the fizz go down faster?": "3334411", "have you ever broken your ankle how?": "1648274", "What does the #21 mean?": "3651236", "How do U end a bad rep.?": "3690922", "what is the meaning of the word \"gnostic\"?": "4235520", "I have always been curious about the Northern Lights phenomenon; why and how do they occur?": "3604031", "What can i do to make myself more..lets say likable?": "4069618", "How is the cost for getting a L-1 Visa?": "1338456", "how do u get ur dad to leav u a lone forever?": "2932816", "Why Muslims make an issue out of everything?": "2829995", "what can i do to burn fats around my waist?": "973859", "How long is the train ride from Italy to Finland?": "4287894", "How do i tell a coworker they have an odor problem?": "3498817", "why is our generation considered emo?": "2696515", "What does the expression \"in a coon's age\" mean and what is the origin of this expression?": "188009", "why not legalize, and tax prostitution?": "11706", "why are cells so important to humans?": "2484177", "How do i get rid of a sore throat and a irratating cough?": "195677", "What does the term 'Indian giver' mean and where did it originate from?": "2971166", "Why do non-religious people post questions on a Religion & Spirituality forum?": "1236343", "How do I stop myself from eating when my stomach growls but I know I shouldn't eat yet?": "1154709", "why do criminals go back to the scene of the crime?": "1458676", "what is the canadian laws and regulations in regards to televison violence?": "1210647", "Why 95% of you are American?": "4478479", "What is the effect of thunderstorms?": "1303286", "What is sublimation?": "2452368", "Why would someone sleep 12 hours a day?": "975932", "What do Starbucks employees privately say about their customers?": "4345846", "What is Na2SO4 + NH3?": "962054", "How does a hold up alarm/silent alarm in a shop work?": "1753747", "how high will gas prices go?": "4065722", "why does't glue stickto the inside of the container?": "1452932", "Hello, how are you?": "2783044", "Why not consider the evidence of speaking of tongues and prophesying in the church?": "2521298", "Why do females become awake after orgasms?": "182417", "Why do men have to wear tight underwear or tight boxers/briefs?": "912488", "How come every white people look gorgeous?": "2012175", "how to cure stomack virus?": "2250547", "How good is the clinical pharmacy practice in Australia in comparison to the USA?": "504039", "why are democrats so ungodly &cowards ?": "3452643", "How does a pardon work?": "1246269", "How can you get a Cockatail to be quit?": "3474588", "How do I make my booty grow?": "2421407", "How does the GI Bill work?": "4409259", "does a ford focus 1.8 TDDI Ghia have alloy wheels and what does TDDI mean?": "3948614", "Why do SMOKERS pollute their lungs, pollute the air, and pollute the environment with their butts?": "1352914", "If God gave \"every green plant for food\" why is marijuana in magic brownies illegal?": "2141008", "why gnome elf always sits on a mushroom?": "2701669", "what is taj mahal?": "2776069", "What does an itchy nose mean?": "4027950", "how can we stop the water shotages ova the world?": "1423745", "Why are most Americans only able to speak English?": "328356", "How to reduce crime and violence?": "3118286", "how will i know if i dont ask?": "1414214", "Tell me why u dont believe in God..and y not?": "2224478", "Why is it you will never see a fat person in a McDonald's commercial?": "4477858", "How do you milk a chihuaha?": "937311", "How is the typcial irish man?": "3973391", "what is the origin of the word 'bootleg'?": "3191224", "How do I help my constipated cat?": "885125", "what is the proper adjective for Belgium?": "1132659", "What are the worst places you've been stationed and why?": "1220528", "why do mexicans listen to circus music?": "4235227", "Why can't we direct a telescope to see if we actually did land on the moon?": "1376687", "Why are manhole covers round?": "839374", "Hi, why do we have two hands?": "2130815", "What are some common causes of my cat's eye to be watery and drip clear fluid?": "1341602", "how do u get to fly to another country for free?": "3993855", "How can we get free of the unAmerican criminal in the White House?": "4057348", "How do you get rid of Puppy Pet Smells?": "3856308", "How do you get rid of matts in a cats hair without hurting her?": "2963160", "what qualities do you look for when trying to finding someone to be with?": "2918856", "What is the legal definition for prostitution?": "1572132", "What is \"gout\"?": "2326803", "How can you vote for cut and run?": "3245911", "In modern times - today why is it that still...?": "753172", "What's the difference between an antique and an antiquity?": "1037976", "Why do I have to have to have the fan on when I go to sleep?": "209181", "Why are Black Men Stereotyped in a bad light in all areas of society?": "2534102", "How do you snap/click your fingers?": "3415867", "how do I treat sciatica at home?": "1158624", "How is Feminism portrayed in The Scarlet Letter by Nathaniel Hawthorne?": "2738945", "How are humans not animals?": "2248306", "why is the sky blue in color?": "3506428", "what do eye doctors say is the age for contacts?": "138795", "Why fibre optic cables are used for transmitting sound ?": "1978136", "How do scientists know the inside of the earth is made of layers?": "1932433", "Why is the Catholic religion a false religion?": "3368975", "i receive an email that my email ID won 250000$ from E.A.A.L did any one receive such email PLS notify me?": "2657907", "How come you never see a black chinese?": "2365151", "What does the phrase \"take no prisoners\" mean?": "2677193", "How do i get rid of a canker sore inside my mouth on my gums?": "63242", "what do boogers taste like?": "3224605", "why do guys sniff their underwear?": "929821", "how do u get coke out of ur system?": "3706515", "How do you adapt in Geneva?": "2325383", "How do you use \"incognito\" in a sentence?": "1495234", "what happens when a young girl &young boy meet alone?": "3824106", "what does Apt# mean?": "4104326", "How have you benefited from using Answers?": "1566780", "How is Chevrolet Aveo 1.4 in India?How is its service network in India as compared to Ford/Honda,etc?": "3562030", "Why do men answer questions on here more then women?": "3679226", "how do you open a can of beer?": "871014", "What is \"marbling\" in terms of cooking a steak?": "3541329", "How hard is an adult life?": "3919874", "What is something that I can put between a magnet to not attract & not to un-attract something?": "2527931", "How Do I Get Rid Of Pink Eye Quick At Home?": "2910592", "Why have the Jews been  so hated and persecuted throughout history?": "3527367", "How do I erase ALL the contacts in my LG 6100 Verizon phone at once?": "1016750", "Why is there no official language in the Great U.S.A. ?": "851093", "How does a person who has diabetes qualify as disabled as part of the work force?": "3397823", "What is the difference between horns and antlers?": "3706997", "why do girls want to become models?": "1657755", "How should I handle husband/employees forgery?": "3779100", "Why fight it?": "1139872", "why do we get fog in the car windshield?": "2354552", "Why are some Americans so prudish when it comes to sex?": "4183127", "Why do angels have to \"earn\" their wings?": "4372862", "Why do I fall asleep after I eat and how can I prevent that?": "2235825", "How do we make a stronge and durable table with ice cream sticks and maybe glue?": "1371419", "Why is the cross product of i x i = 0?": "2330967", "what pet do i have?": "1852661", "how does water affect table salt?": "2961542", "How does a brown cow eat green grass and have red blood and give white milk?": "148703", "what is the difference between a colonoscopy and an endoscopy?": "1766931", "How do you know if you bombed a job interview?": "522791", "Why does Affirmative Action still exist?": "583561", "What is the difference between the modern Christians and Muslims?": "2116707", "What is the total number of accidental deaths in the entire history of paasenger carrying aircraft?": "156984", "how can i get my chihuahuas to listen to me?": "2644036", "turn a nine into a ten if u can excite me..what does this mean?": "2083543", "How does knowledge reroute our self-esteem, aggressive instincts, and natural fears?": "4179393", "Why do US citizens support the massive wall at the border?": "4233966", "How do you keep your parents from divorcing?": "643630", "what is a hilar mass?": "1063908", "Why does world hunger still exist ?": "462162", "how can i get water out of a cell phone?": "3306959", "How do I keep stray cats from using my flowergarden for a litterbox?": "740628", "how can i strengthen my eyes?": "2613648", "why is methyl benzene more reactive than benzene?": "1790550", "How do I kill a mouse?": "2226616", "How can I safely open a geode?": "2465966", "what are the \"rules\" of christianity?": "175971", "How can the voters in New Orleans vote Nagin back in?": "2118991", "How do you get rid of a gloomy feeling?": "2083742", "When and why did the term \"gay\" go from meaning all happy and jolly to meaning homosexual?": "2768098", "How could I return a jacket through Fed Ex?": "3823976", "How Do I Get My Wife To Stay Awake?": "1904065", "How to fight with african problems?": "2414843", "how do i find a good home for my dog?": "1306945", "how can i get fatter legs?": "1626564", "why do some people get white spots on their finger nails?": "17889", "Why isn't the word 'gullible' in the dictionary?": "3766274", "why do stupid questions constantly receive intelligent answers?": "339497", "How do I live with AIDS?": "1269249", "My daughter has an ear ache-  What can we do ?": "2238049", "why is gas mixing with my oil in my 95 ford windstar?": "379928", "Why is it easy to forgive?": "2895152", "What is the easiest way to clear flem from your throat?": "1579607", "what is mardi graw?": "2643424", "why do I get emails from single women in alasksa and I hate cold weather?": "968378", "why do ignorant and unintelligent people get to ask questions here?": "577414", "what are money market accounts?": "4417624", "Why does a tropical fish cost hundreds of dollars?": "3289198", "is there anyway to get rid of weakness of eyeside?": "1358226", "why is it that chevy is coming out with junk ass cars?": "3271638", "why do \"bubbas\" in the southern states, vote republican?": "3897392", "What what symbols represent the seven contrary virtues?": "2624526", "Why is the US virtually the only nation that does not use the metric system?": "3751886", "What is G Spot?": "1198060", "why do the mexicans drink beer wiht lime?": "4402047", "how do I stop my Rottweiler's eating small children?": "103626", "why do i have such bad luck?": "1666920", "how can i make clay?": "1666035", "Why do Wiccans believe that they have magical powers when they don't ever produce any magic?": "358253", "What is the mean of attracting attention in the process of advertisment?": "266016", "why dont new zealand and aussies get along?": "2843882", "What are liberal values?": "4047002", "Why do new watches sold always show 10:10 on the dial?": "3108867", "Why is the greatwhitehype this way?": "1413908", "What does apathy mean?": "2502618", "Why don't the Greeks ask the British to return some of their ancient artifacts like the Elgin Marbles?": "221601", "What do you feed a mallard (duck)?": "2063597", "What causes honda cb750K motorcycle to backfire intermittently?": "712755", "How can I change the Car steering wheel from left to right for different countries?": "3374260", "why is donuts so good?": "1458241", "How does evolution disprove god?": "2867851", "Why do Americans bless God?": "3177139", "Why don't our own body smells affect us?": "1689712", "How are Ice Ages formed?": "901770", "How do I make my dick bigger?": "2841645", "how is lava made?": "3556937", "How Can I Find out which Tribe of Israel that I descend from?": "13893", "What's the difference between a cabbage?": "1433442", "How can I find a job in Canada being a foreigner?": "1500550", "Why do we allow incompetent M Ps to tell us what to do?": "1136016", "why am i always bloated 24/7?": "2535684", "How do you know a prophet is real?": "3236132", "What is our children learning at Sunday School?": "1156567", "what is your favorite video game and why?": "3305940", "what is the difference between a 6th form and a college?": "613280", "What means getting laid\"?": "1357649", "what are the importance of algebra in college level?": "1395208", "How does a snow making machine work?": "4345857", "what is 15cc?": "2913866", "Why are Americans labeled as \"evil\"?": "1991463", "how can i get online account information on my debit visa credit card?": "3013959", "why do people have sweaty palms?": "842540", "how to get rid of headlice?": "189452", "I know why we are at war, but what are we trying to get?": "1598547", "what is your theory on why dinosaurs are extinct?": "2609241", "Why didn't Jesus teach about unicorn evolution?": "3495025", "why haven't there been any manned missions to mars yet?": "3804019", "how do we know Jesus was real?": "2744807", "What does elucidate mean?": "4092472", "If animals adapt to there surroundings why havent thay adapted on mars or any where else?": "3677095", "Why and how males and females misunderstand each other?": "2707513", "Why do American between the ages of 18-35 don't vote?": "3882948", "How to file an official complaint against a high school?": "1980933", "how people can earn English?": "19632", "Why don't white supremacist's just move to Germany?": "292326", "How to prepare butter from cream (malai)?": "1089427", "Why do we consider our religion to be the greatest?": "3060013", "how to get good Tax returns?": "3873558", "If evolution is true, then why are there still apes?": "4456639", "Why Americans are linguaphobes?": "1954300", "why is ice-cream soooo good?": "3736941", "is there a difference between a german sheapard, and a germon police DOG?": "2787424", "what is zero gravity?": "570602", "why was i fired?": "2380130", "Why do you refuse to blame the System instead blaming on Immigrants?": "1873405", "what is buddhism?": "481314", "Why does lapdancing have such negative connotations?": "2492710", "how can i use oil pastels to draw a flower without usin the colors white and black?": "3239272", "Why is it cheaper to buy return flights to Manila from the UK than just a one way ticket?": "3907385", "Why is hot tea so bland?": "1365601", "why dont they sell .hack// stuff in stores only on internet?": "4295017", "how can i prepare to hag trip?": "261460", "How can i keep my hair form being poofed out?": "3113391", "Why do we allow our government to steal our hard earned money?": "3084222", "How do you cure poison oak and poison ivy?": "2500918", "why does it seem that no matter how hard you try.....?": "2704", "what is the meaning of DUI?&what is the fullfom of it?": "1387930", "how can I become a con artist?": "3363058", "How do I get big muscles?": "3220395", "how to create skin colour using water colours ?": "1463221", "why dose my cat take off for days?": "2285109", "What is the difference between the SPCA and the Humane Society?": "4033049", "How can some one so negative go to hevan [if there is one]?": "1191621", "what is th easiest way to make a fire by using the suns heat?": "474052", "How can I get rid of my lovehandles?": "2960956", "What does kissing in a dream mean?": "3853647", "Why do you change the oil in your car?": "138255", "what is avyohya?": "4409", "how can the height of a person whose age is 25years male be increased from 148cm to 160cm atleast?": "2645037", "How to fight against \"hatred\"?": "2199025", "Why in a Democratic society such as the USA have only 2 main political parties?": "1905396", "pls folks,what is rigor-motis?": "2156753", "why do we vote on politicians to make decisions, shouldn't we vote on the decisions?": "3675821", "What does a albatross symbolize?": "1937100", "how to give up smoking ?": "574551", "What does a blank orange road sign mean?": "586477", "Why do some men spit into the urinal before urinating?": "2531329", "Whats the difference between public and private goods?": "2143893", "What does the christian coalition say about the Da Vinci code?": "3323833", "What is the difference between fat free milk and non fat milk?": "1671799", "What causes itching hands,arms and feet that turn red?": "835400", "What does the word \"ballpark\" mean, and how that word orginated..?": "4137967", "if you suspect you may have glass in your skin still from a car accident...what do you do?": "2940661", "How do we know the sun rotates?": "1345517", "why do we wash bath towels if we use them after we are clean?": "2885400", "how can i get rid off my pimples,white/black heads, and oiliness of my face?": "317469", "Besides peanuts what can you feed a wild squirrel?": "58975", "How can I help you?": "2049551", "How do I check and add oil to the supercharger on a 97 Buick Riviera?": "1595991", "why is speaking in tongues evidence of the infilling of the holy ghost?": "488483", "why every plane disappear when they cross over the bermuda triangle?": "1329815", "Why are christians so obsessed with what i believe in?": "2651364", "how can i prevent noises from my ps2 while running?": "1180877", "Why are there more lesbians and gays in the world today?": "1183782", "why are people intimidated by authority?": "1071800", "How good are women at faking and why would they want to?": "4389692", "why do dogs turn in circles before they lay down?": "1128551", "How to help heal bruises faster?": "2342195", "What does <3 , <33, and <333 mean?": "3384231", "what is \"nippon\"?": "4087556", "how do i check if i have an arrest warrant for free?": "2908187", "How to grow a beard?": "3203027", "what do jews base their claim to israel on?": "4232776", "How can I get icons back on my computer?": "4422858", "what is a subliminal messenger?": "1913984", "Why does a woman's mouth go dry during intercourse?": "600689", "how can i levitate?": "452099", "What is the meaning of the human Pancreas?": "2540227", "How do i become more ppular in school?": "4095419", "What non-astronount was on the Space stulle and what was her name and what did she do for a livin?": "2858910", "how can i clean the fuel injector?": "167923", "Why does ppl hav leg cramp?": "3775643", "How did ray charles contribute to society?": "3747127", "What is there to expect when you turn 17?": "595342", "Where do the origins of the easter bunney come from?": "2419560", "What do you do on the weekends at boot camp?": "745754", "How do I stop my parents blaming me for all their arguements?": "4153039", "Why is the Darfur situation getting so much media and celebrity attention?": "3123225", "how to decrease weight 100kg to 70kg?": "2735795", "how do you use defense on tekken 5?": "15125", "what is the chemical reason for peanut butter getting gum out of hair?": "2585320", "how to start drinking?": "2816432", "how does a man hold a door open for a women when the door swings in instead of out?": "83371", "How do you tell the difference between hamster genders and if their mating or not?": "2639331", "Why seek tenants for a home that is being placed on the market?": "3803380", "why do I just can't start doing my homework?": "2932160", "How was Australia involved in World War 1?": "417841", "do i have the right to ask an employer why i did not get a job?": "4282051", "How does a person become a Kentucky Colonel?": "2664903", "What happens to all the forces when an airplane cruises?": "4164581", "why are people so mean to harry potter?": "4144269", "what is colder ice or ice water?": "2057410", "how do i get rid of parasitic intestinal worms without going to a doctor?": "2001160", "why does the sun go on shining?": "1174906", "how to build up your HIV immunity?": "3550980", "How does hypnotism help someone quit smoking?": "641844", "what are the appropriate flowers to give?": "863525", "why do i like the smell of pee?": "2022250", "Ladies  watches are smaller than that of male, why ?": "596721", "how do you deal with a schizophrenic?": "690125", "How can you get chewing gum off clothes ?": "283350", "Can You Tell Me How To Get POKEGEAR While Playing Pokemon Ruby?": "869319", "how do you get illeagls to get out of the u.s.?": "31028", "how can i write c.v. (resume)  saccessfully ?": "3005935", "If a priest takes a vow of celibacy, why don't they just become eunuchs?": "3147423", "Do anybody know how to make smoothies?": "913281", "how can i prevent leg problems from being on my feet so much?": "686983", "what is the definition sutures of the skull?": "2665645", "why did the french and the dutch establish in the americas?": "740606", "why is organic all natural food  more expensive?": "1727879", "what is GDP?": "207747", "Does any one know how to find out about an insurance claim...?": "3172166", "why do we sing god save the queen?": "2335411", "how can i stop my cat from going on the furniture?": "2957646", "Why are americans so fat?": "1940950", "why do doctors&nurses wear lightblue or green for opration in the theatre and not red related toblood or white": "207580", "Why are some cars' turn signals amber while others are red?": "4330797", "Why is V8 a juice and not a soup?": "1212724", "How do new ideas come across people's mind?": "2505550", "What happens when he disappears?": "3459285", "What is the meaning to life?": "284239", "How do I update the 360 to 1080p resolution?": "3321549", "what caused hemmoroids?": "3838937", "Why do criminals practice crime?": "212427", "Why don't we call homosexuals what they are, Sodomites?": "3147557", "Why is riligon more importiant in the south than in the north?": "357773", "why is the English languaje so difficult?": "181855", "How do i deal with my wife?": "2212624", "why don't houses in florida have basements?": "412657", "How can i spread the word of the gospel at a young age?": "3751940", "Where did the phrase R.I.P come from?": "3173766", "what is the reason why nursing students need to study science and technology and society?": "1501302", "Why are my memories in third person?": "1038108", "how to pronounce Aktiengesellschaft ?": "3213191", "how do u say im losing my mind in german?": "4334814", "Why do Republicans get so angry when Democratic leaders like Kerry speak the truth?": "2464797", "What is a schnitzel?": "3280274", "how late do you sleep?": "1787885", "How can i stop my dog from eating poop?": "3864211", "Why is there so little positive press coming out of Iraq?": "3911272", "What is the meaning of the English word \"bloody\"?": "420742", "Why  I smell like anmonia after exercising?": "4386534", "why do porno stars never take their heels off?": "2433082", "Why do random strangers keep asking me what ethnicity I am?": "2942624", "how do i get rid of fleas off my cat?": "1637629", "how does one give up all parental rights?": "925338", "How is riding a horse related to physics?": "55210", "Has anyone had a food that was just 2 hot, how do you get rid of the burn?": "3738110", "how can I find a diabetic freind?": "3495304", "how can i make myself remember thing?": "782835", "Why does the media refer to Saddam Hussein as Saddam and not Hussein?": "933612", "What can I do tonight?": "485408", "Why are truffles so expensive?": "4384685", "Wonder why cops don't give you a break?": "1513971", "Why are atheists mostly depressed?": "3958139", "What is the symbolic meaning of the cross?": "1500541", "Why is God \"male\"?": "2630860", "what do you feed box turtles?": "942123", "Why are some people \"pro-choice\"?": "2856191", "How to study 17-18 hrs a day?give me practical tips.........?": "2764765", "what are cooperatives?": "827811", "what are the laws regarding the sale of lock knives at a car boot sale?": "55679", "What is the different between Catholic Church, Christian Church and Baptish Church?": "4436221", "what is the strongest force of nature, the heat or the cold ?": "2489934", "Why do cats like to sit on paper?": "492161", "Setting aside the issue of whatever the something is, what do you mean when you say you know something?": "466610", "how to extract water out of carpet in the car?": "2065351", "How do you clean starch from an iron?": "460171", "Why should I become a Christian?": "868075", "How is clothing used to portray characters on stage or in the movies?": "1543498", "how do i convince my parents to let me buy a new videogame?": "3118733", "what is a milner?": "828917", "how do you know when spaghetti noddles are cooked?": "3899872", "Why dont you believe in evolution?": "940650", "How did Henry Ford contribute to the Economic boom in the 20's?": "635599", "Why don't cats go grey with age?": "1812531", "how do you remove a head liner from a 2002 Dodge Intrepid?": "2038434", "what is a solid solution samples?": "2782549", "What is Ogopogo?": "2961191", "Have you ever wonder why egg is usually serve at breakfast?": "3660044", "Why do we worship other gods............why can't we worship one?": "527615", "how do i pass from litres to grams?": "2018204", "my ex-boyfreind was deported for drinking and driving also for drugs he is back, how do i get rid of him?": "4473502", "why do we dont like the smell of milk?": "1768961", "how may metres in an acre?": "3407341", "What is ductile-to-brittle transition ?": "93948", "Why are there different denominations of Christianity?": "3463789", "Why is my geko's stomache fat?": "2031287", "Im a fresh graduate and plan to study MBA now.Whats the pros and cons if i dun have any working experience?": "3736954", "What is the most important number, and why?": "3841762", "what r homologus organs&analogous organs?": "335819", "Why are earthquakes common in Indonesia,not in Singapore?": "3937645", "why do i have a stomach upset after taking in carbohydrates?": "2775277", "Why do some people gossip excessively?": "679751", "what borough of new york is 45th and madison?": "904440", "What is ment EXACTLY by abnormal ejaculation in patients using Effexor?": "926357", "how to pierce a dog's ear?": "2277774", "Why are there Atheists?": "4186521", "Does anybody know what became of the Lizzie Borden house?": "2777831", "What's the difference between a paradox and a contradiction?": "877139", "How do I stop my cat from clawing the leather furniture?": "3290727", "What's ethylene-vinyl acetate copolymer?": "483676", "Why is Brad Pitt so popular?": "349442", "What happens to the illuminated light in a room after you turn off a lamp?": "2966086", "Why is eating raw eggs good for you?": "908348", "how do i go about finding low income renting in calgary canada?": "2246169", "Why IV drug usage is growing fast?": "295928", "EVERYONE KNOWS THAT WE R MADE OF CELLS.HOW R INDIVIDUAL CELLS ATTACHED TOGETHER,WHY DONT THEY JUST SCATTER OFf": "1038856", "How To Prepare 'dhokla'quickly and properly?": "1588152", "What the \"poached\" mean?": "2468677", "How can I make a head goal?": "3991584", "how was copper first extracted?": "839952", "What is the Roles of Calcium in human physiology?": "1353933", "what is a cotton gun?": "3624504", "how goverment of malaysia overcome smoking?": "2605992", "How do you ladies like Curve cologne on a guy?": "3309663", "What is saffron?": "2819007", "Why are tiny white specks floating in my water after the ice melts?": "3192600", "why am i not rich :)?": "3203149", "what is locust?": "2736707", "How and Why does ice float?": "2808917", "she wont potty train what do i do?": "2359288", "why do people say 'bless you' when you sneeze?": "3224443", "why is your blood blue in your veins?": "2774571", "Why do people need water after consuming dairy?": "404751", "is there a starting(origin) of the earth....if there ,,,then why it is started...how it is started..tell me?": "1163367", "is spritual growth important to u?why?": "3309398", "why dont president bush like black people?": "652556", "How did Greek culture spread through the Middle East?": "1595167", "Why do dog go bathroom on the funiture?": "1933929", "how do you prevent nipple abrasion when exercising?": "3311993", "How cheaply can I install surveillance equipment to catch the babysitter stealing?": "1595983", "how can you get rid of a headache?": "3391409", "why am i so shy?": "99112", "Why do Catholics have thier babies baptised?": "4060665", "How do I cook a great chuck roast?": "2361270", "Whats the difference between Boot Camp in Parris Island and Boot Camp in San Diego?": "3186954", "What is the difference between Hotmail and Hotmale ?": "1440810", "why does God take the young?": "1474989", "If you had a superpower, what would it be, and why?": "3265005", "how do u get rid of acne on your butt?": "1498260", "why receptors are good drug target?": "94629", "For guy's only.Why.........................?": "763359", "how do you make bean soup?": "315784", "why dont vegetarians eat meat?": "1592740", "How do i stop myself from sneezing?": "1474986", "Why does my budgie bop its head up and down at me?": "1992282", "How are memories retained?": "1299745", "what does it mean to be a conservative?": "1271675", "what is a huffler?": "4449648", "Why is america so biased?": "276277", "How can I prevent myself from always being hungry?": "168371", "how do i cure tick infestation (bad) in a dogs ears)?": "3547791", "What is the history of  LAUS DEO ?": "2276852", "What is the purpose of ebay web site?": "2106769", "besides \"setting goals\", what are great ways to motivate yourself to workout?": "660820", "how can I associate evolution to \"genealogic tree\"?": "1021287", "how to treat srained ankle?": "650412", "Why can't dogs have chocolate?": "4330580", "how can i become a better ballet dancer?": "189364", "What is your favorite online multiplayer game and why...?": "186072", "What is the ratio of fat in common pig bacon?": "645602", "How can I get rid of a boil, on vaginal labia,and underarm pits?": "2169746", "how do you chose a religion to practice?": "3322150", "What is the difference between garbage and trash?": "2677531", "How can I get welfare?": "698030", "what is X  if 6x+12=24?": "2080327", "Why does america claim they have freedom of religon?": "751", "Why do teenagers start to smoke?": "851454", "How do you educate a libral?": "3377302", "Why was farming so difficult in ancient rome?": "2150486", "How can someone \"draw a blank\"?": "4247945", "Why are things funny?": "2897686", "Why Galvanised bolts are used to join wooden beams together ?": "1581993", "Why do libs keep making up conspiracy theories?": "3577456", "Why is Satan bad?": "479542", "why is George bush the president?": "747254", "Why is it that people consider The Daily Show the news?": "1246849", "Why doesn't glue stick to the inside of the bottle?": "2147417", "Why do some religions forbid eating pork?": "3404277", "How can you qualify as a certified MLT with a biology degree?": "4109764", "do u know what a chode is?": "2758266", "what do u mean by atomicity of an atom..?": "4458585", "Why are most perverted questions on here coming from?": "3853366", "how do i reduce 96 hundredths?": "892289", "Why do you read?": "554539", "If sex is meant to multiply, why didn't God make sex painfull, and the giving-birth-part pleasant ?": "3665416", "What is the best way someone taught you how to do something new?": "4179739", "Why does my cat make clicking noises with its teeth and salivate when it is just resting?": "3217850", "how do i motivate myself to continue exercising and stop eating all those yummy choclates and cates?": "3193043", "what are the document requirements for visiting US as tourist being as international student in UK?": "340569", "Why are children so creepy?": "2701160", "What is the bigest problems with teenagers theses days?": "1458125", "What is so great about a rottweiller?": "3080874", "How would you comit the perfect crime?": "137779", "Why are African Americans Are more prone to get cancer?": "2112754", "How do you give you give an ear job?": "28274", "What is meant by standard of living?": "2011913", "what is sosiology?": "332662", "how do we know the memory span of a goldfish?": "3045504", "How do gas stations get the prices to change on their pumps?": "3182248", "Is more difficult to train a male versus a female?": "3382182", "We want to have a dog in an apartment and have contacted some real estats.But all rejected.how can we find?": "3111156", "why is 40 spelled as forty and not FOURTY?": "2897971", "how can i become a wealthy man?": "2299281", "For everybody, including Muslim: What is the origin of the name 'Allah'?": "4045477", "why do bubbles form in a glass of soda?": "2716897", "why does taco bell always make me nauseas?": "242701", "What is the role of a teacher to that of a student?": "2376664", "Will the laws of gravity ever break?": "4436147", "How are the abbreviations on the periodic table of elements determined?": "1219396", "What is the difference between first and business class on a flight?": "2371162", "how do you get rid of sweat stains on clothes?": "2573803", "Why hasn't smoking and alcohol been banned in the United States yet?": "678951", "why does my dog bark at nothing?": "2724170", "how hates school?": "50546", "why did the japanese kamikazis use helmets?": "1105578", "How do you take ink out of clothes?": "3248219", "what is the origin of the slang word johnson?": "35829", "why does my cat like to march up and down on my back or stomach when im trying to go to sleep?": "3303019", "what does the term \"net on receipt\" mean?": "938620", "How do i get a job working at NASCAR as a driver?": "1011178", "Why are people dumber in the south than in the north?": "1047252", "how can I get my rights back ?": "3510027", "What is involved in an artists' portfolio?": "2094435", "why is the top of your nail white?": "3085220", "How do you become an undercover cop?": "1459082", "what is basic difference between knowledge & wisdom?": "1188052", "Why isn't Amway illegal?": "3649101", "What are the psychological effects of music?": "3866454", "How come eggs don't taste like chicken?": "977032", "how do I find out about a traffic accident?": "3213105", "Why is it so hard for a guy to call when he says he will?": "3985402", "what is a mandula oblongata?": "3231140", "what's the purpose of my life?": "1015398", "what do the smaller qantas planes have bent wing tips?": "1841367", "breath blows out candle, but kindle's glows why?": "827807", "how real is the threat of global warming?": "1000063", "How do you get th Sims 2 to work?": "120755", "why do people have to complain in the post office?": "2791132", "how do I remove a cross threaded nut?": "4261253", "gosh why am i so adorable?": "1578687", "What do you consider a \"redneck\"?": "165479", "how do i get rid of car sickness?": "1488590", "How do I find flight arrival for flight CA1587 on China Air Beijing to Weihai?": "3904533", "Why are Christians Vegetarian?": "559091", "how is the constitution ammended...whats are the steps to ammend it?": "1608655", "Why is the U S A  a super power?": "4001250", "how does the sun cause the wind to blow on earth?": "1759762", "Why European Union do not give membership to Turkey?": "1245035", "what is the difference between fiction and nonfiction?": "1533032", "how can i keep my cats from scratching my leather sofa?": "721897", "Why do females have a softer skin than males?": "2921856", "what does Romans 3:31 mean?": "2849580", "Why Do People Always Question The Facts?": "2624612", "how can i loose wieght without crash dieting?": "441073", "Can one forget how to juggle?": "1204326", "Why does God move in mysterious ways?": "2764410", "Why do my kids have guns?": "545641", "What is catnip anyway?": "1636014", "what is mechanically separated chicken and why is it listed as such in slim jims (instead of just chicken)?": "1075604", "How do you get rid of a wrist cyst?": "2301752", "How do Christian fundamentalists justify using the Internet?": "1603091", "why is diffcult for some parents to teach sexual education to their children?": "2278645", "How do I protect my name and address from being used fraudulently?": "65974", "why do people light a candle when someone dies?": "3716089", "What does the Bible mean by calling Pride a deadly sin?": "2041828", "How do I get wrinkles out of thin plastic party tablecloths?": "3152429", "how do you increase bone density?": "4316015", "Why did liberals ban the pledge in California?": "3185074", "what does kiss the deivl mean?": "3751146", "how do i know my e-mail was received the person i sent it to?": "1009182", "Why don't Catholic's eat meat on Easter Friday?": "1426564", "how should i kill fleas of my pregnant dog?": "905674", "why does my husband put olive oil in the pan and then immediately take a paper towel and wipe it out?": "4553", "what sounds like a clap?": "1907847", "how do they get the curves in Pringle potato chips?": "3264162", "what is your definition of ebonics?": "320716", "How can I become a vampire?": "818796", "Why do some say, \"God is dead\"?": "105760", "how to fix scratches on eye glass lens?": "941054", "why is it so easy to be bad?": "544869", "Are you supposed to feed a fever and starve a cold or starve a fever and feed a cold?": "4338314", "How do I tell my friend I don't want to co-sign a loan for him?": "4440341", "How do I give up the illusion of being seperate?": "2317886", "how to stop sperm leak?": "57572", "What causes thrush mouth in babys?": "2516489", "What is the real solution to achieving peace on earth?": "3704812", "what is the difference between mitochondria and chloroplasts?": "1671629", "If earth is moving then why do we land in the same place when we jump high?": "4052068", "Evaluate the credibility of the following list of sources: newspaper, magazine, television programs, movies, t": "3282426", "Why do they put Braille dots on the keypad of the drive-up ATM?": "2477620", "Whats the general difference between Republicans and Democrats?": "2865888", "What if the hokie pokie IS what it's all about =)?": "1121034", "Why were native alaskans interned during wwII?": "1239167", "what actions i should start to take and what not to take in the case of electrocution?": "2343388", "How dangerous is a wound from a deep dog bite on the hand?": "861342", "Why are blacks reluctant to therapy?...even when its provided by their insurance?": "2596663", "How do I turn my home into income property?": "1520479", "Why do I strain... and strain... and a pebble plops out?": "251279", "Why is the Catholic Church so afraid of a work of FICTION?": "3283579", "why do the americans bastardard our language?": "3210818", "why do they put braille on a drive through atm?": "937635", "how do you make my dog less excited around people?": "2476938", "Why are salt water pet fish more colourful?": "3479191", "Why is Barbie not loving to Ken anymore?": "4059874", "what does an appraiser apprentice do?": "3186945", "why can't i post to a finance message board?": "1512776", "How do you know if you have diabetes's?": "2830826", "How do I keep my dog off the bed?": "1542660", "Why doesn't McDonalds have ketchup in conveinent containers like the rest of the dipping sauses?": "1897806", "why did the revolt of 1857(india) fail?": "1999245", "If a non-graduate's experience and knowledge is greater than that of a college grad, why would they earn less?": "84192", "Does death scare U and if so why?": "3191168", "how do i get a best personality?": "3378918", "Why is it so disheartening to receive a bunch of smart-a s s answers to these questions?": "3625483", "How do you dail 911?": "1173625", "What is the meaning of enimity?": "104964", "What do I do if my child was verbally and phisically abused by a school staff?": "1071602", "Why do i keep coming on here asking stupid questions that dont really matter PRAY TELL?": "1467322", "How did \"FLY BY NIGHT\" originate?": "99743", "Why does my nextel turn off by itself?": "1423289", "how can i get rid of a migrain ?": "1398281", "-how does playing pool deal with science?": "1211877", "Why Audi is doing good now?": "3917106", "How do  I wire a seven speaker, powered subwoofer system?": "1525597", "how is the force of an earthquake determind?": "3639522", "how can I get a lover without any effort?": "3747275", "how to make a water that cold faster?": "4270972", "why does a plane  flight from London to New York take longer that the other way around ?": "1691245", "Why do you abort a precious baby?": "2530303", "How do I locate someone using their ss# or driver's licence or license plate?": "237138", "how can you tell if someone is lying?": "2599299", "how do you get rid of an tooth ach?": "3900539", "why is corruption high in the third world countries?": "404359", "How do I prevent Mosquito bites?": "2656513", "why Moslems says that Muhamed is the most noble prophet of all prophets ?": "1957792", "why does my fish  tank look cloudy and smell like plastic?": "1877451", "Why does a Welshman wear velcro on his knees?": "1186429", "How can I love math?": "949163", "If u could have a power what would it be and why?": "3718128", "how can ppl tell if they r bipolar?": "4287367", "why is my job soo boring?": "3255435", "How can one Change his Voice?": "2056685", "What #'s double is greater than its half by 51?": "3825668", "why does one get a runny nose?": "1643903", "how can i deal with my anger without medication?": "1580836", "i want more money how to get?": "4241358", "What is your favorite holiday and why?": "2033670", "Why do some of you seem so gleeful about The End of the World?": "1187159", "How can I drive without windshield wipers?": "775468", "Why are pple wasting money convicting known criminals like Saddam and the very dead Milosevik?": "2265634", "Why do some people try asking a Q, when they dont even know how to spell certain words?Huh?Just wondering.....": "3341891", "How to stop crdit card  offers  sent  in the mail?": "66665", "Why do girls have to be so imotional?": "934816", "Why does my male cat have a pooch between his hind legs like he's had babies?": "2656601", "What is Gary Larson's history?": "1127245", "How is splitting a laser beam dangerous?": "278043", "What is completely factored answer to (x-y)(x-y)?": "352299", "I have an unwelcome visitor in my flat - how do I get rid of it?": "3352085", "what is the best way to remember something?": "1243388", "What is the difference between two cats fighting and two cats playing?": "2957066", "Why does my right turn signal not work when I turn my lights on?": "3614846", "How is fish not a meat?": "3344119", "how do you get to level 2 with 165 points?": "617809", "how can i find/meet a master of Buddhism?": "1669483", "How to convert an electrical device to a battery device?": "4202927", "What is the cutest breed of the dog and why?": "1161848", "why do idiots take time to answer a question?": "2076798", "Where and how can i find airbrush painting (aerography) artists to perform on cars and bikes?": "867318", "why do we have different languages?": "2029136", "Who Know what the Seven deadly sins are and why are they?": "3648206", "if u fail ur exam how u explain to ur parent?": "3598485", "How do you get your day started?": "4410561", "why do the weather so hot this days?": "259425", "why did god create women?": "4077830", "how do you get kanker sores?": "4146352", "what is the procedure for getting a paternity test?": "3635284", "why was Saddam not tried in a international court ?": "786695", "How can I stop eating unhealthily?": "2429048", "How do I keep my kitten's from climbing on the curtains?": "3935718", "Why is my chihuahua (male) so hateful?": "2421078", "What is/was the most powerful Empire in history?": "1676126", "In Judaism, what is the reason G-d flooded the Earth?": "330693", "why does my vagina stink so bad?": "1763087", "what does 'bada bing' actually mean?": "4444877", "how do i unlock a cell phone?": "1707150", "why not put   Mr ramsefield   in a trail for all crimes and torture he committed in Iraq and Guantanamo ?": "3505798", "What do people have against using turn signals when they change lanes?": "3666764", "What's the best asian and why?": "684633", "Why doesn't my name appear on my friend's cell phone when I call?": "946189", "How do you beleive?": "202695", "Why is Trent Lott back?": "1465308", "If nothing sticks to teflon then how do the get it to stick to the pan?": "2397508", "Why isn't failure an option?": "684322", "How to open a bottle of wine without a corkscrew?": "2943171", "why an airplane can fly?": "82028", "How do I get to level 2?": "1338893", "how can i prevent acne?": "934652", "Ever wonder how we can spend trillions of dollars on war, but can't feed and shelter the poor?": "4002599", "What are the effects of smoking, besides destroying your health?": "2393376", "Why do the shells stick on my hardboiled eggs?": "2237774", "why is the praying mantis so sexy and such a fine specimen?": "2724617", "how did cave men figure out how to reproduce?": "1707718", "Please read the followings and tell me why they are wiped out by yahoo cops?": "2264433", "What are the benefits of smiling?": "2331884", "Why is fuel so expensive in the US?": "2125870", "Why do only Republicans defend Martha Stewart?": "3814583", "Havin sex can make u fat?if yes.then how can we reduce it back?": "2794579", "Why do weather men say its going to be warm when its actually up to each individual whether its warm?": "3032521", "how do you stop becoming overweight?": "4086475", "What are the effects of decibel levels & how does it affect the hearing?": "287122", "Do You Dislike Cops, Why Or Why Not?": "1146231", "Why does Proffessor Snape kill Headmaster Dumbledore?": "584891", "why shouldn't the government ban smoking in public places?": "1504308", "How did the cowboy fall of his high horse?": "1167855", "How can  i stop myself from eating today?": "883019", "Why do Americans talk slow?": "623304", "What excuse can I make?": "745874", "What is a 'fortnight'?": "1306167", "How come it doesn't mention the dinosaurs in the Bible?": "4233574", "What does Israel have to do to get sustainable peace?": "1640170", "Why does bacon stick to paper towels in the microwave?": "3505611", "What are some examples of Amish food?": "2647320", "What is my cat doing?": "916180", "Why does fart smell?": "358587", "what are some unwritten rules while using a urinal?": "489705", "Why is gas so high; and the war is over?": "2467769", "Why are people sticking to Atheism?": "4047638", "How do women sleep?": "328483", "How can i get rid of dark spots?": "745673", "How does perspective work?": "442495", "Why aren't fairies and mermaids real?": "3312049", "why there is a lot of poor people?": "539944", "Why does prayer never, ever restore an amputated limb?": "2410311", "Why is that we drop bombs from thousands of feet away and not fight the enemy face to face?": "3216304", "Do you mean what you say and say what you mean?": "2146313", "Why do hot molecules move faster than cold molecules?": "1970273", "Why is the Bible true?": "1055173", "how difficult to find black jobs in sweden?": "2611317", "what is difference between spear and javelin?": "2728135", "How bad is smoking if you have high blood pressure?": "2201202", "how to win in a fair hearing for medicaid?": "2971316", "why is matt azimi stupid?": "494016", "what christmas tradition is expressly forbidden in the bible?": "2388214", "if ou were drugged and raped how coould you tell?": "3918878", "How do I tell if my miniature schnauzer is pregnant by palpating her uterus?": "1866686", "why do they have prewrapped sausage and not  prewrapped bacon ?": "3530904", "whats the difference between a 2001 yamaha r6 from florida and an r6 california model?": "4084231", "What is your definition of pornography?": "2175167", "why do we associate cops with donuts?": "36736", "How do I stop my cat from being a nuisance and meowing for hours at the window?": "3614579", "Why do birds suddenly appear evrytime, you are near?": "4141706", "what are possible causes of aching hands?": "845508", "what are some exercises to strengthen my lower back?": "1906648", "How do you get rid of dog poop smell in a flower bed?": "900392", "What to do for pain relief from burns?": "2142537", "Why does every couple have it's moments in a field?": "3121835", "How to make my first Million?": "1294053", "Why confessions split but never join?": "125626", "How are we suppose to be \"law abiding citizens\", in the U.S. when we are never taught 'laws' in school?": "442781", "Why do Conservatives say a Democratic Congress will raise taxes?": "3155989", "how do you get a dog to stop chewing your shoes?": "3466554", "What is Eucalyptus?": "3024878", "how happen the earthquake?": "4457820", "how to figure gpa?": "3033488", "why do I turn bright red when I drink?": "2362256", "how do u dye easter bunnies?": "2556575", "why do ginger haired people burn so easily (sunburn)?": "3801064", "Why did i get married?": "1913249", "why do aches and pains act up more when the weather turns nippy?": "2373092", "how to get mythral shards on kingdom hearts 2?": "963523", "Why do we press even harder on a remote-control when we know the battery is dead?": "802970", "Why do they put pictures of criminals up in the Post Office?": "1637019", "what is their to be happy about?": "587607", "why is there a fence runiing on the sides of the freeway in the middle of the desert up and over rough terrain": "1188438", "how is the world made?": "3106331", "why can i not get my childsupport info on here?": "2290094", "i wanna know why baby powder repels ants...?": "4119715", "what is the difference between coach and business class in an airplane?": "1339870", "How do I find the location and identification of geocentric satellites in the sky?": "605841", "how does a ship's engine work?": "1463653", "What happens when salt is dissolved in water?": "4238378", "all christian gornaments are terrorrist why?": "720170", "what is meaning of rap?": "4469011", "how does smoking cause emphysema?": "3124538", "If people evolved from apes, why are there still apes?": "2251032", "Why was Jesus Christ killed?": "2220518", "what is a saleen mustang?": "1327141", "what is meaning of greek word \"c\" in english?": "4389469", "Why do space shuttles move when the rockets are fired but not when water is ejected?": "2418824", "what are the advantages and disadvantages of being vegearian?": "4208182", "Why do we talk to communicate?": "1353263", "why dont we ever see Turkey eggs?": "1114696", "What is a Cayman and what does it look like?": "3800918", "What does cut your losses mean?": "3760014", "Have you ever wondered why most Bibles are black ?": "3150973", "how can I help my bunny become more energetic?": "36645", "why does my cat eat grass?": "2924401", "Do you know what is that mean if someone live in the glass house ?": "2333900", "Tell me why I should quit smoking again?": "1560114", "How do I get an i20 visa por a foreing tourist visa studend to study in a public university in Florida?": "910612", "how do u know its the real love?": "2229301", "What can \"Check Engine\" light signify in my 94 plymoth voyager?": "3626847", "Why does my Caprice......?": "4282000", "how can we prevent and or treat video game addiction?": "1240077", "According to liberals, why is it a \"sin\" to be?": "175732", "how/can a restraining order be reversed?": "399263", "Why is it 12:56 why not 11:00?": "4380573", "what is an I 94, what does it do?": "1024914", "why do girls dont like guys how smoke?": "875917", "Why did the Holocaust begin?": "2809444", "Why am i expected to bag my own groceries nowaday's?": "2561878", "How do I stop my Blue Pittbull to stop whinning all the time?": "2667973", "Should the use of cell phones in cars be banned in the US why or  why not?": "1898104", "What exactly does 'overdrive' mean or do in automatic transmission cars?": "254962", "How do I get popular?": "3193262", "what is a colloquialism?": "758652", "How do I get my x-boy friend to go out with me agian?": "3098890", "What is the reason demon disturb the human sleep in the night time?": "2491890", "Why are dead cockroaches always found lying on their backs instead of face down?": "3885753", "How Can We Avoid HELL?": "2835161", "why am i leaking breast milk?": "2840716", "how do you remove ingrown hair on beard?": "1572243", "Why do we give money to Saudi Arabia and other Arab Nations and also Israel?": "1026982", "what is persepolis?": "1530148", "What is the difference between Devils and Demons?": "530682", "How does the Speedometer determine the speed of the Car?": "4429419", "why does the density of your body change under water but not a rock?": "2720726", "Why does the color of urine varies everytime you go the bathroom?": "4097849", "Why do women ignore the red spot after crossing legs?": "245637", "What is homeophatic treatment for Gastro Esophageal Reflux Desease, what are the process?": "1319337", "in terms of newtons law, why would a ball roll to the back of a wagon when pulled forward ?l?": "849151", "what is black art?": "3317208", "what's the perfect christmas gift to give a guy?": "2456263", "What's the difference between apprehension and comprehension?": "2471885", "Why are some women attracted to male death row killers?": "114972", "Why scientist don't find a proper medicine for cancer?": "690202", "How can you tell if someone is gay?": "1034314", "Why not declare Election day A HOLIDAY so that every body can vote with ease?": "2182357", "Why are democrats the coolest people in the world?": "1208376", "what is your favorite school subject, and why?": "2301267", "How can we recognize poor peaple scientifically?": "3691064", "How do I open my own web page?": "2557409", "How can I find out what my calling in life is?": "4177666", "how do i get slimmer thighs?": "2695109", "How can I get a cat thats over $10000000000000?": "4332233", "how do u boil water in the the new club penguin mission?": "1206908", "My dog will only pee in the house, how do i make her go outside?": "1440529", "why do we need to eat two servings of fruits and vegetables ?": "4183970", "how do get out of being behind of two months of homework?": "4193878", "Why do we want our relegion to be accepted and the only way out?": "886153", "Why does Viagra last and hour when I only need three minutes?": "832971", "how do i treat ingrown toenail without going to the doctor's office?": "2098975", "how do you controll a man in his 20's?": "1629403", "why eating meat is good, lots of info needed?": "3752962", "How do I peel onions without crying?": "1618655", "how is marraige counselling supose to help?": "2876739", "How can i get toy stores to donate toys for a project im doing?": "2464943", "what is a \"slider \"appetizer?": "3023333", "What is the difference between a public sector and a private sector?": "1475950", "why do my toe nails keep falling off?": "680492", "how can i become a private detective?": "2301882", "how do i get an us passport?": "3554911", "If I get wasted, and then have to work the next day, how can I avoid smelling like alchohol?": "2115670", "Why do they use sterilised needles for death by lethal injection?": "3258010", "i just can't stop eating what can i do?": "4339483", "how does a hearing aid function?": "3026569", "Why is the government willing to create new military weapons?": "2483570", "how bad can an ovarian cyst get?": "3856800", "why are auto tires not made of all rubber why do they need air?": "107944", "How could I become a strait forword rich?": "1366833", "Why does a person need to be humble?": "4022485", "what causes and prevents a charliehorse?": "2790934", "what is a synonyom?": "923913", "Why was the Berlin Wall built?": "3490142", "Why would Texas Republicans Vote for a known Crook?": "3812079", "When dealing with Scooters, what is the difference between street legal and moped legal?": "3023429", "How to improve one's comnunication skills ?": "3988571", "Why do people drop out of high school?": "4103172", "how did salt get into the ocean?": "4009768", "What is the pH of a 0.4 M solution of CH3COONa?": "2048278", "How does one quicken their reaction time?": "3042987", "How do you get diarrhea on purpose?": "3819566", "why is Pi not a Pie, it hungers my brain yet I`m not full,?": "1608105", "how do i treat/clean cast iron pans?": "1459754", "What is the best way to get rid of stomach gas?": "1687161", "how can you get rid of scars from self harm?": "204818", "if all martyrs go to paradise.why dont clerics rush to be martyrs?": "3765149", "If a person only posts negative questions what does it say about the questioner?": "2642336", "Why does Christianity teach...?": "114758", "What are some ways to overcome lazyness?": "3945253", "How can we solve a problem?": "1295284", "How to calculate which is a leap year?": "96036", "Why most of the atheists are genius?": "2693196", "what happens if lightning hits a plane?": "1132356", "what is the meaning of Tina?its a name of one of my friend but she doesnt know the meaning?": "227920", "How do you divide x^4+6x^3-10x^2+2x-1 by x^3+5 ?": "3360040", "Why is vinegar only available in glass containers?": "2869623", "What does the name Glaeken mean?": "36909", "why do I need an IRA?": "3950084", "Have a white coffeemaker ,is getting brown,can somebody tell me how to clean it,tryed every thing thy?": "3196746", "Why does urine smell after eating asparagas?": "784531", "like to know how to make crispy...french frys?": "1651933", "how do i know if someone is using voodoo on me?": "922490", "How can u get  rid of a bipolor disorder?": "1483383", "Why do people go to coffee houses to relax and socialize?": "1907578", "Why didn't Jesus choose a female apostle?": "4288566", "how do u tell the difference between a male cat and female cat if the male lost its testicles?": "3524378", "What do I do with my 401 k plan?": "1142306", "how do i build up muscles to jump higher?": "2591146", "What is a creative title for a project dealing with photsynthesis and cellular respiration?": "2061264", "how can i be strong sexually give me some recipe with the herbs?": "2158350", "How do you plan on stopping smoking today?": "2291375", "Why can't americans call a toilet what it is?": "726010", "Please explain how the sky, the earth, the trees?": "1040553", "Why do men miss the toilet?": "545531", "what are tempons?": "52981", "How do I find an intellectual woman in chennai?": "3597818", "Why do people yawn?": "2467372", "What is a INSRANCE?": "4321996", "how is light energy turned into heat energy?": "3958214", "how do you pronounce concierge?": "3545997", "what is a routing number (has to do with online banking)?": "2387445", "How does the extraordinary man arise between his ordinary counterparts?": "1779139", "how do i erase previously viewed sites?": "503463", "why were dogs ever invented?": "2352180", "why CAN'T pigs fly?": "2590387", "how can i find  the results of blood work i had done?": "1335330", "how can i find out what is a minor in the state of missouri?": "2547349", "what can be done if a federal judge clearly misinturped the law and the petition of wit was denied?": "1923464", "what is the difference between a lesson and a lesson plan?": "956761", "so how bout them apples?": "1054142", "What difference will it make making English the official language?": "2598173", "How do you keep peach cobbler from being runny?": "4433714", "why do some cats have double paws?": "4249350", "what information do you need to register to take your permit test?": "1886202", "what is a spectrum?": "2168196", "Why does the sky turn green during a thunderstorm?": "1242249", "what is active transportation?": "1949736", "Why are there words replaced for meat and animals instead of dead cow, beef?": "2492445", "How can I legally remove myself from a cell phone contract with Tmobile and sprint?": "53122", "How do you get a cavity?": "3908876", "how can i improve my driving skills?": "2723810", "How are swfemales finding partners ?": "1993879", "What causes a tooth to be sensitive to heat and cold?": "3257098", "what is a relay?": "452550", "How do I get up the nerve to start substitute teaching?": "2476912", "Is there anything i can feed to a baby duck besides chick starter?": "498337", "How honest are you?": "2180502", "How do you justify belief in the afterlife?": "969848", "How do you get yahoo messenger?": "1243448", "How can I exercise to lose more fat than the amount of muscle gained?": "4388258", "Why do NSAIDS cause problems with the cardiovascular system?": "2264974", "Why are liberals incapable of identifying and confronting evil?": "2522067", "why is there chinese chartacters but then you can spell them out in english i.e ,\" wei, Ni how ma\" VS the": "1536937", "How do I get my cat to stop scratching the leather chair?": "1206348", "How do you know when someone is gay and how do you aproach them?": "3274939", "How does raising the interest rate when inflation rise supposed to help the people?": "2536970", "how to get rid of a bad belly ache?": "1781827", "How high is the sky?": "2859959", "what is giz?": "2684856", "Have you ever fired a real estate agent and why?": "4248249", "what is the meaning of my first name Andrei?": "2534994", "Why are us mens brains in our pants?": "4363907", "Why are huricannes named?": "4315325", "Why is Bush approval rating dropping?": "3947483", "How cute is my dog?": "2585142", "If mortgage interest rates rise sharply, say to 10%, what effect will that have on the value of real estate?": "3366613", "How to get rid of a facial tic?": "3404794", "why is DVD player better than VCR?": "2193031", "How insecure is the catholic church if they see a FICTITIOUS book as a threat?": "1932466", "how do i lose weight especially on my belly?": "3602419", "how can I remove my braces at home?": "1372267", "Why would more people spend their money seeing movies Like \"The Da Vinci Code\" and?": "1862666", "how do you get reed of a hickey?": "2481638", "how to apply to mcdonalds?": "794484", "What is the nature of GOD?": "3151509", "How do I do a credit check on others?": "1938375", "How come you can still drink when upside down?": "284076", "how do u lock (in dancing) like how do u glide and how do u windmill?": "380222", "Why do Christians wear footwear to church?": "3440161", "I found a 5 leaf clover once, how rare is that?": "1587762", "WHat is the easiest way to make chocolate mousse?": "2543919", "Where and how did the phrase 'worth one's salt' originate?": "2067770", "why are people concerned more with nudity then violence?": "3568689", "What do the numbers 69 mean?": "1176673", "How do I distinguish sweet potatoes from yam?": "528180", "why do SOME Christians go psycho about dumb stuff?": "2411936", "can someone give me an example of how hope can be evil?": "3520669", "Why do immigrants sneak into the US illeagaly instead of just coming over leagaly?": "3001388", "Why doesn't Salt Lake City have its own sub category?": "1037897", "how have u been doing?": "543118", "what is the papulatation of catholic realegionin the world?": "4285614", "How musch do substitute teachers make?": "3021308", "Why do the English call the Scottish 'Jocks'?": "1199893", "douse any one know how to install the Sims 2?": "466890", "my cat runs out the litter box and wipes its but on the ground - why?": "2431724", "How do I keep my employee from leaving?": "2717408", "Why do they sterilise the needle for lethal injections?": "1939511", "Why do teenagers and college students get tattoos?": "2541536", "Why did pastor ted haggard try making me feel guilt every sunday when he was the one humping male bodybuilder?": "699402", "Why is Bill O'Reilly so ignorant?": "863700", "Is the problem of frequent urination at night related to sleep Apnea?": "2817055", "What are the causes of airplane crashes?": "3729071", "what is the second coming anyways?": "1637796", "how are adenine and guanine different from thymine and cytosine?": "1758173", "Why, in some nighborhoods, are there shoes hanging on the telephone wires?": "3542087", "why russians are always happy?": "1683001", "What does it mean when a dog licks its own private?": "2148071", "Morning wood...why do guys get it?": "4381437", "Why does the church hire swiss guards instead of catholics to protect the vatican?": "77854", "Why is my dogs skin getting a black spot?": "196233", "How do I tell my mom to stop smoking?": "2577932", "What are the negative affects of not laughing?": "1179972", "What does \"All that glitters is gold\" really mean?": "687892", "What causes high blood pressure?": "3318553", "What's the worst teacher you ever had and why?": "3917708", "what is the coolest tattoo you have?": "4102013", "What exactly does censuring the President mean?": "2505599", "Does anybody know why white people smell like dogs when they are wet?": "3094620", "for what purposes do we use the computer?": "746919", "How do school janitors and garbage workers live together in peace and harmony?": "1610334", "how do you use lube?": "220575", "how do you adjust the shore hardness of PVC tubing?": "2620160", "why is brocolli good for you?": "1011598", "Does anyone know how to get rid of cold sores?": "4183962", "What can cure a sore throat?": "1337612", "Why society rejects sex workers and deny their human dignity?": "2126255", "how do u get a life ?": "1103991", "What it takes to be a successful therapist and what attributes to have?": "3997781", "How do i write a teen fiction like a professional?": "3203999", "Why we have to take breakfast and skip dinner?": "1540901", "Where are you and what is the weather doing there?": "2259676", "Why do Muslims justify killing people everyday?": "4360542", "Why do Conservatives get to decide what is \"moral\"?": "1140512", "How do you get into politics?": "1322383", "Why is my manager an a$$hole?": "4068073", "Why doesn't my credit report show my credit score?": "3285411", "what is mail id of GOD?": "1920407", "Why do people have two nostrils?": "1727343", "how can you change the density of an object?": "3556941", "Is the term \"fat lass\" offensive and if so, what is an acceptable expression?": "1385576", "What are the factors to consider in buying a motorcycle?": "2044211", "why do Americans worship a paranoid schizophrenic lame duck president?": "4040448", "Why is depression replaced by anger when using prozac ?": "1355180", "what is phosphowolframacid?": "2892396", "why u.s is trying 2 help israel  so what about palastene israel has more weapons than palastene?": "1583099", "Why  dont Illegal Imigrant workers come to work here Legally?": "2735209", "Why do some black women jerk their heads side to side while talking?": "3203664", "what's the Zionism?": "183677", "how can we cut the onions without tears?": "4201402", "Why be a gay man is so difficult?": "3330660", "Why did Jesus  get mad at the Pharisees for not killing children?": "2271494", "what should i do if i burn my fingers?": "2578801", "why are private parts hairy?": "372637", "what is front elevation?": "4377784", "What's the difference between \"partly coludy\" and \"partly sunny\" in weather man terms?": "2387713", "If leviathan is a whale then why is he refered to as a serpent, and why does it say it can breath fire?": "4348281", "How do i get my dog to use a kitty liter?": "235059", "How to get rid of bone spur on ankles?": "1254145", "why woul a keyless entry for a car not lock but unlock and you here is a click?": "3172912", "Why do lobsters \"scream\" when you cook them?": "3059922", "What does BMR stand for when you are talking about health and what is BMR?": "344029", "what is the purpose of black history month?": "3990014", "If the Ethiopians really have the Arc of the Covenant, why isn't it in the Vatican?": "1893441", "what does the word Tuscan mean?": "555476", "i have thunder thighs, how can i get my thighs smaller without losing muscle?": "2808829", "How can I get rid of permanent marker?": "4116521", "How can I make my female cat go to the toilet outside?": "1153674", "how does a lizards tail still move after it has been removed from its body?": "4062183", "Do you know what ICE means?": "2429243", "what is the best way to potty train a puppy?": "897291", "Whats the difference between MEIN KAMPF and the QURAN?": "3442042", "How can I find out what crime someone has been convicted of?": "1607926", "what are the causes of college dropouts?": "4450252", "how does the earth go?": "1607924", "Why have we forgotten about Africa?": "1429350", "how to sell items online?": "973349", "What could cause sudden weight gain in the belly area?": "1343714", "Why is having someone ignore you more hurtful than outright dislike?": "3920975", "Why can't u wear white shoes on Labour Day?": "2035638", "What is the capitol of washington Dc?": "2272542", "How to get oder of spoiled meat out of car?": "525186", "why do people have too get older?": "1923183", "What does interpolation mean?": "4253098", "how to select a good doberman pup?": "4472254", "How Do Blind Men Pee?": "2998396", "how can i get cigarette coupons sent to my home?": "2816877", "Why shouldn't people be allowed to drink and smoke in a pub?": "4246221", "Why do men continue to ask how to make their penis larger?": "1224005", "how can i get my dog to sleep on my bed?": "227569", "why do liberals act like buttheads?": "4134366", "being a textile manager how can i take advantages over the copetitors?": "205155", "If donald duck never wore pants, why did he wear a towel when he got out of the shower?": "558752", "How do I prevent a ripped fingernail from ripping further?": "2660679", "What caused the decline of Athens?": "422159", "Why do medical malpractice cases take so long to get through our legal system?": "2199097", "What is your view on Harry Potter?": "3840558", "What are blueprints, and why are they blue?": "4105488", "How can I convince my dad..............?": "885549", "Why do cats purr?": "3409233", "What are some REAL CHRISTmas songs?": "2962253", "why my petrol tank has pressure when i take the petrol cap off?": "3750817", "How common is AIDS in animals?": "3010674", "Why is the world a smokers ashtray?": "4451091", "why does bread make cookies soft?": "2466505", "Why feed the trolls?": "1705597", "what is the maine reason of car accident?": "1395064", "How can i increase my metabolism?": "3000557", "what is angiocath?": "2141847", "How to become a rich person?": "160340", "What are the pros and cons of learning to be a veterinary technician online?": "4233614", "how do you remove the radio from a 97 montero sport?": "2929639", "what happens if overdraft on atm account and receive ssi?": "2685407", "what is a good way to get rid of stress that i have about the STAR testing?": "2972961", "How can i reduce my sexy feeling?": "2330486", "Why am I gaining weight?": "377736", "how do you send pictures to the \"PSP\"?": "3780692", "why is 3-methyl-2-pentene the major product when 3-methyl-1-pentanol is dehydrated?": "176023", "what does \"don't feed the kangaroo\" mean?": "674294", "can someone tell me how to get fat?": "3096233", "How can I attach a balloon onto a wall?": "2298064", "How do  I know if a guniea pig is scared or happy?": "146696", "what is antiretroviral therapy?": "1265829", "Why is it a turnpike?": "2516309", "can I feed my red eared slider steak?": "2155390", "What is a 6 cyl car engine?": "4208418", "what is a CCD?": "3901476", "Why won't you give me money?": "2634857", "What is white noise?": "2615234", "plz give me some facts on the history of cricket?": "1952443", "how come why i put my car in park the engine revs on an off but when i have the air on it stops?": "3187205", "Why is the end of a marijuana joint called a roach?": "788265", "Why do I have Filipino accent?": "1363590", "why does a anglo person always claim ancestory of cherokee blood when taking with other native americans?": "4160568", "what does experian (credit reporting agency) require in terms of identification?": "63393", "what are the pros and cons to being a veterinarian?": "926625", "How can I prevent my son from being the same as me?": "68423", "Why do pussy cats meow?": "450758", "My dodge ram wont stay started after i jump the battery why?": "4096934", "how do i replace a lost deed to my house?": "1400344", "Why did I join the army?": "1769606", "How can I pick winning Lotto numbers for California?": "676624", "Why is autism increasing?": "365807", "What happens if Lieberman switch parties?": "829540", "why do husky's have coloful eyes then other dogs?": "2678635", "how do I fold a set of maps to make a map book?": "2447143", "If evolution is false, then why do we have different races of people?": "2756008", "Why does my kitten go potty on the floor instead of using her litter box?": "2982969", "why would i want to become a pediatrician?": "935262", "why is motivation important?": "3563936", "Why is my dog limping?": "416070", "Why did my friend get fired?": "833038", "How do I stop my dog eating grass and leaves?": "2837473", "what are the health benefits of exercise?": "4443943", "Why does Ketchup only come in packages?": "3805092", "Why must I keep paying for the sins of the father?": "3358025", "Why are people so gullible?": "1934561", "What `s she-ba mean ?": "3325541", "why are air conditioning vents near the ceilings of rooms and heating vents near the floors of rooms?": "3085580", "Why does my cat chew up card board boxes?": "2153711", "Why is that almost all the terrorist muslims?": "2072335", "how do i get rid of my big belly in 2 weeks?": "3656360", "how do you write an appeal?": "960208", "What is first pass metabolism?": "132386", "What is the speed of Gravitational effect?": "2129080", "What is the difference between Organic and Inorganic Eggs?": "3159749", "My girl acts strangely when in intercourse.Why?": "3595945", "How can i help the environment ?": "2659459", "Why does an ice-cube, pressed down on a pile of salt on your arm/skin, cause a white, burn-like mark?": "781209", "What do cats do when their owners arn't around?": "3104337", "What exactly is club soda?": "3011939", "how do you take care of hamster/gigy pig?": "3104841", "What does eclectic mean?": "3872185", "How do I deal with a pulled muscle?": "2817114", "how to convert dollars into ponds?": "1725511", "What is the quickest way to get rid of a bruise?": "3278803", "what's your favorite chewing gum & why?": "325889", "How can I pick lock my school lockers?": "1708867", "How safe is soup left out overnight?": "3028301", "what do i say to a grieving friend?": "522203", "who decided what order the alphabet is displayed on a keyboard?": "1345135", "How do I become a shark hunter?": "3511514", "Why do rose bushes have thorns?": "413785", "How can Christians not believe in evolution?": "3633776", "Why did Bush start the world....?": "2423895", "How do you make a can of coke explode?": "2807076", "Why doesn't my cat cover up her pee in her litter box?": "3716940", "How does relationships effect you and your health?": "3096528", "Why is the Dow Jones Industrial Average 220 points down?": "1288434", "Why are almost all Realtors White?": "3077870", "how to lose 20 pounds in 4 weeks?": "2489233", "how come my crap smells like dead humans?": "3905597", "how do i stop my cat from being mean and attacking me?": "877177", "why does Mexicans teens get their sweet 16 at 15?": "3370270", "How do you wire an 800 watt inverter?": "2700836", "Why do people give up on life?": "4227229", "why do people have an instinct to place their hands on their head when someone wants to hurt their head?": "1936704", "Why don't truth in advertising laws apply to religion?": "4324696", "What is an \"encronologist\"?": "2137263", "Why do some people have brown spots on the white part of their eyes, what are they and what causes them?": "109629", "what is the mean of bibliography?": "2678484", "why do they say dont keep eggs in the fridge if there is a special compartment in most fridges for eggs?": "2620488", "Why do we put the letter \"k\" on the words knife and knob, knee ?": "3427615", "Why ''Holocaust''word is allocated toJews,what name for 15-million  African Slaves drowned  in sea ?": "3410762", "what is the hissing noise in street racing cars between shifts?": "4082166", "How can I overcome negative thoughts about myself?": "2429652", "What is a great summer job?": "181119", "How can I get my cat to play more?": "3962764", "Does anybody know how to make homemade steroids?": "2007128", "What is the best Bar in New York and Why ?": "1156271", "how/do tarot cards work?": "1582044", "Why does the skin on my hand peal?": "2109905", "why am i so sleepy even though i had a goodnights sleep?": "1514356", "how to make canon a80 camera work as a webcam ?": "3841202", "why do they sell 8 hotdog buns and they sell hotdoys by 12?": "846085", "how do i explain the cuts on my arms?": "377256", "why i can attract a man if I'm a man?": "1038354", "how to increase sex stamina without medicines?": "4327257", "how does a plant reproduces?": "1289219", "How to stop rabbit from peeing on the floor?": "3961", "how lng you go to jail for trespassing?": "3872849", "What are the pros and cons of a Hummer 2 /2004?": "3580416", "What is the purpose of female circumcision?": "4309174", "why are you vegetarian?": "1395602", "how do i find out about my credit report without signing up for some serve i cant get?": "4405518", "why do some animals always have more than one baby & some animals don't?": "4400543", "Why do urban youth hold up their pants with one hand as they expose their underwear?": "2330474", "What is your favorite religious verse and why?": "191703", "What is social equity?": "754214", "Why is Bush raising the prices on gas?": "3743161", "How can I get more energy?": "1791111", "What is the definition of a Creative assistant?": "985969", "How can I make a model hermet crab?": "2340845", "How do prehistoric animals fit into the bible?": "1538567", "why do ghosts only come out at night?": "784022", "why do we find bricks in toilets?": "3178012", "how does cyanide affect the electron transport chain?": "4110902", "what  places have   you  always  wanted to visit and  why?": "1976900", "Why do we as parents tell our children not to speak to strangers?": "2914849", "Why is \"lie\" in the middle of \"believe\"?": "3793577", "i know what sine is, but what is sine qua non?": "1916171", "Why do dogs bark more at night?": "3107835", "If God talked to Moses why didn't God explain to Moses about evolution, why all the day 5 day 6 lies?": "1978816", "How can I get water out of my ear?": "2306533", "why did hitler pick on the jewish?": "1550388", "how can finish my high school .i'm 30?": "2969924", "why does black history month have the shortest days of the year?": "3601077", "How do I make a portable baptismal?": "3064194", "how do I get rid of a bird's nest @ my kichen window?": "17665", "What does the word 'Testimo' mean?": "1805750", "how do i get to 111 n wabash ave chicago il 60602 using the blue line?": "3142338", "how can i read other lanuages?": "605708", "How can I keep from crying?": "2252152", "what is a home remedies for dry cracked feet?": "4256175", "why do we read while eating?": "3456301", "my german sheperd dog developing lumps on its body ,why?": "3564298", "what is the correct form: I wear glasses or I am wearing glasses and why?": "3374970", "how can you quit without giving 2 weeks notice?": "874526", "What does loyalty mean to you?": "1092221", "why do dogs continually do what you told them not to?": "1833752", "What is the sexiest accent and why?": "2544058", "how dio i get rid of the hiccupps?": "1948910", "What happened to hurricane Katrina victims?": "4395876", "How do you express the anal glands for an epileptic terrier?": "4122917", "Why are we forgetting our GRAVE?": "2844097", "Why isn't there mouse-flavored cat food?": "1756161", "Why is obesity running rampant in the United States?": "4331040", "Why are not car bumpers have to be at a standard height and made of rubber?": "1562412", "how do you install a oil breather on a 1994 ford tempo?": "363519", "how do I become reconized as an artist?": "3536350", "what is methanol gas?": "3761716", "how do i avoid sleep?": "1700886", "Why is 22/7 so special?": "4403913", "How do you draw a portrait of William Howard Taft?": "3703530", "How to decide which TV to buy?": "3977930", "Why metals prices are getting all time high?": "1471877", "how to get rid of fat from beer?": "3638873", "how to make a reseme?": "3857484", "How can i get my dad to get me an xbox 360?": "4352570", "Any suggestions on how to improve my spelling?": "3971156", "How can I recieve a high school diploma without attending high school?": "3238369", "how can you do nothing?": "3657619", "according to u what is ethics?": "1084948", "Why do my balls smell funny?": "1962421", "If a coin is tossed twice, what is the probability of getting heads both times?": "2571912", "Why do girls discharge a white stuff odorless?": "3505458", "How are FICO scores calculated?": "2901754", "why isnt kate at school today?": "1466563", "what is the size of the hub nut on my '89 olds cutlass ciera 3.3 v-6 ja2 (brake code)?": "1866181", "what are the disadvantages of coffee?": "168257", "why does the sitting president get the blame for everything that happens .Congress gets off free?": "1652633", "why is L.C.M of rational numbers not posible?": "3894654", "Why do the girls like French accent?": "4272863", "why do teenagers do not obey their parents?": "940391", "why mosquitoes dont suffer from malaria?": "2917760", "Why does Islam seem so obvious a solutions for all spiritual needs?": "428827", "How can i find out whats on her lil mind?": "2500197", "why people just adapt children no adult?": "1523477", "how did everything begin?": "1523474", "what is the dark brown/black residue underneath my radiator cap?": "3631491", "What does Vodka taste like?": "2518355", "how do you break your foot easily?": "2799211", "what happens when u put a piece of carrot over a flame and what does it have to do with carbon?": "4034340", "what does water taste like?": "1468989", "what is martuher luther king jr.?": "611357", "why does the mass of a tray of ice cubes weigh the same amount after the ice melts ?": "1696904", "how do i get rid of the hiccups?": "3025319", "Why is Olive Cardenas ugly?": "172939", "why FATHERS are males?": "3691443", "What is currently the meaning of life?": "986260", "How soon should i put up my mini christmas tree in my room (be specific)?": "596415", "How do you make maple syrup?": "480608", "the gulf stream - why does it happen?": "1247354", "Why do cars have to display Tax Discs when Government ads keep telling us in a scary voice that they know...?": "3483549", "What is the name of an annually grown flower?": "3248169", "what are some ways to keep a teen active?": "1261048", "Do you believe the world is coming to an END..what about the signs?": "1130835", "Why are non-drinkers so obnoxious?": "4050447", "where and how kalsurp yog puja done?": "2718204", "Since the rainbow is associated with G-d (Gen. 9:13), why do homosexuals identify it with them?": "3818883", "What causes a book to be popular?": "837327", "what is the first idea u have once u open ur eyes in the morning?": "3536820", "Why is public speaking such a pain?": "3114401", "How difficult is English to learn?": "544220", "If math is your worst subject how did you pass your classes in college?": "3348365", "how do you get rid of seed warts?": "4477752", "Why 'libido' uses impersonated Id to put questions and then answer herself and rate herself as the Best?": "3414721", "why do you think people read crime fiction?": "194526", "When masterbating, what are the important facts of what you should do and shouldn't do?": "2218930", "Why do we put up with the heresies of science?": "961127", "Why do Wint-O-Green Lifesavers spark in the dark?": "1101959", "How can I find out if I have a warrant without paying a fee?": "126182", "Explain to me why you dont like jehovahs witnesses?": "1628890", "A Christmas gift for a friend?": "1123138", "How do I demonstrate I have manual dexterity?": "1985900", "how can i use the word ---Gruff-- in a sentence?": "1660886", "How can I convert a 3 phase 415 Volt delta induction motor to 3 phase 240 Volts delta?": "2007954", "how can i put an mp4 file into my PSP without MAX media player?": "847439", "Why do people pee and poo?": "2091144", "what is an expediter?": "1560704", "how can i make a sanwitch ?": "2275385", "what age do staffs stop growing?": "3097338", "Why is islam trying to conquer the world?": "291657", "GIRLS PLEASE ONLY: how do i know if i had my period?": "1019070", "why does the engine oil warning light come on when there is sufficent oil there?": "3718873", "Hello ,iam priya.I want to ask about our mind.How can i get peace of mind.then how to escape from cheaters.ans": "2717424", "How do you get rid of dead bird smell from a bin?": "1000944", "How do you trim fresh green beans?": "373125", "How do I keep my dog entertained when he is home alone?": "1511753", "what is patty cash means?": "3026796", "what is the purpose of the m- and m+ key on a calculator?": "3666720", "How was your christmas?": "3581966", "How does the Bible explain the word knew?": "2520637", "Why, exactly, is upsidedown cake, upsidedown?": "4337455", "why you have freckles?": "3197574", "What are the melting and boiling points of the element Cerium?": "2183964", "does any one know a quick prayer i can e mail a friend whose daughter is dying?": "2025478", "what are chormosomes?": "1881599", "Why do females get so offended when a male calls them the (b) word when they call eachother that anyway?": "276151", "Why did it take thousands of years to to reach the technological level of the Ancient Romans?": "355019", "How did I stick to my alarm clock to wake up?": "1226612", "What is a peanut if it isn't a nut?": "1557632", "Why is Islam always associated with terrorism in america?": "1990217", "what is the difference between a tornado warning and a tornado watch?": "921237", "How can we reunite the American children whose parents have been deported with their parents?": "616554", "why do guys hardly evert get pimples?": "940641", "what does 'despuerta' mean?": "4174946", "How do you get rid of a sour throat and continuous coughing thats been ongoing for 2mths now?": "2114139", "How fast is the Chicago Transit Authority train?": "3608433", "How to make water boil faster?": "1395470", "what does arrivederci mean?": "3449067", "Is there a way to workout my arms without using dumbells?": "1014897", "what does 'get r done' mean?": "3899249", "how can electricity can hurt us?": "3883240", "How do I tell a guy that i dont like him but still have him as a friend?": "3787174", "what's the difference between flash and hard-disk mp3 players?": "165719", "if you have tadpools,what do you feed them?": "304210", "How do I tell someone they have BO without offending them?": "3020829", "How do i get rid of freckels?": "3765829", "what is the definition of answer?": "1289770", "What is exactly meaning of immigration?": "2463402", "How to stop loving someone that hurt you so bad?": "4033786", "what is female orgasm and how does it occur?": "276424", "When someone dies and nobody claims the body, what happens to it?": "1210377", "Why do dogs spin around before lying down?": "758538", "What is \"double dipping\"?": "3428664", "Why do black people talk on the phone in the movie theater?": "3146069", "How can School leavers get jobs that ask for experience when they haven't got any experience ?": "304522", "Why Do Christians Get Mad:?": "807871", "How can i pull myself out of depression without medication?": "3279519", "why can't I be lucky enough to see a radical islam protest in the USA?": "3044079", "what is the full meaning of AIDS?": "2235643", "How does a single parent with four teenagers get rich?": "1607303", "why do women shave their legs in winter?": "353396", "How do I get rid of paid medical bills on my credit that I went back and paid off?": "994401", "how do I keep my cat from scratching my leather couch?": "4387641", "Which is your favourite inspirational quote and why?": "1066058", "why do we say mother earth and mother nature?": "1505945", "What does in absentia mean?": "1797511", "What is so bad about the Seal Hunt?": "2492366", "How hot can water to get (in degrees Celcius)?": "1551287", "how is a dna test carried out,i mean wot is used eg blood,sperm,e t c.?": "352867", "how do you get super glue.....?": "1444790", "What happens physically at the moment your body dies?": "1252919", "What do the terms \"dry\" and \"extra dry\" mean when refering to a drink?": "4481807", "why do american's say eggsit?": "1647624", "why r u supposed to only workout every other day?": "668342", "Why weren't there cats on the Enterprise in Star trek?": "2132058", "why are dog's noses wet?": "1778616", "What is axon?": "3850366", "How do you get human pee smell out from a small bathroom?": "2713450", "What is a quadriplegic?": "937242", "Why is it, that the people we allow ourselves ...?": "2312285", "what dose it mean when someone says 'i put myself on a line'?": "3201838", "how can you tell when a liberal is lying?": "4140854", "Why do liberals hate Christmas?": "2960653", "Why is defending your home considered terrorism?": "1436466", "If everything King Midas touched turned to gold , how did he go to the toilet?": "1676287", "How do you seperate oil and water?": "3784396", "What qualifications does Steve Irwin have?": "1609132", "Why cannot the wealth of the world be shared to end suffering, poverty,basic needs and hunger?": "3752287", "How do I find out my Fathers Service ID Number?": "3378965", "how to renew a vietnam passport?": "4359213", "Why did prophet Muhammed allowed his companions to eat the food tainted with flies?": "2653191", "why am ifat?": "1153320", "How do i know what the property tax will be on a home in Hamilton County , IN?": "3693247", "what do you call a close friend?": "4358746", "How come its not working?": "1379392", "why are pads so uncombfortable?": "1301551", "what is the difference between naturist and nudist?": "45136", "how should you break up a jail relationship with out hurting him more.....?": "4159788", "Why isn't puberty starting for me yet?": "1785790", "Why is Grand Theft Auto so popular?": "2456744", "How will a personal injury settlement effect my SSI benifits?": "4275003", "why doesn't my dog poop?": "4059952", "why can't I find cashews with their shells?": "4163070", "Why would a woman develop more pubic hair in late twenties?": "2477786", "What is pbenzylhydroquinone?": "2500692", "How do you deal with telemarketers?": "829764", "What is the difference between a wedgie and an atomic wedgie?": "1600685", "If God is supposed to be perfect, why didn't he create us perfect?": "903915", "What is the name of an eye condition that makes the eye extremely painful to go out into bright open sunlight?": "3960175", "How do you keep your dog from tracking in dirt?": "3473655", "How to explain to Son how to start conversation with girls his age of 13yrs old?": "2345573", "What were the causes of the current war in Iraq?": "4308477", "how an aeroplane works?": "2296682", "why do pigs wallow in mud?": "727663", "What were the similar causes of the French and American revolutions?": "1539020", "how can i know what i like?": "2380537", "Fellow Canadians...how have you been affected by the changes on Income Trusts?": "1409714", "How can I download music to my Sony Ericsson w810i?": "920603", "why all the mobile contact numbers start with 9?": "1006398", "how do i remove my braces by doing it myself?": "2901526", "If humans are related to primates, then how come chimps have dark eyes when humans can have lighter eyes?": "1877395", "a new family member could have what effect on children's behaviour?": "2327750", "how is sniffing glue related from drugs?": "3029507", "why the months vary in number of days?": "824874", "What happens to the electricity from a lightning bolt when it hits the ocean?": "1208958", "Why does the packaging expand when food goes off?": "2859920", "what's the difference between allergies and infections?": "3430320", "how do we know god is a man?": "1612251", "What's the difference between the American and the Canadian accent?": "3373628", "How do I find out if a doctor in Texas has been sued for malpractice before?": "1885563", "How do you fix a broken off rear view mirror?": "1144531", "what is the difference between chlamadomonas and eu glena?": "29946", "What should I do if I'm constantly dizzy?": "1043692", "how to make pineapple upsidedown cake germain chocolate cake?": "3272207", "When and why did GMC stop making the Sonoma?": "2510788", "How do i get \" Rid \"of  my neighbours Pig`s?": "3510352", "How are icebergs formed?": "2681990", "Why does Yahoo sponsor an anti Semitic FIFA?": "2916918", "what is a personification poem?": "1902489", "How do I get rid of drainage in  my throat?": "3358544", "Why does my dog raid the cat box?": "3001267", "anyone know how to stop a dog shedding and getting hairs everwhere?": "3788361", "Why do people call the day after Thanksgiving \"Black Friday\"?": "1686720", "Why can't white men jump?": "3451762", "How high are gas prices in your area?": "3251870", "how do I look up a business if I only have the telephone number?": "735075", "When you go to buy a watch, why do all the watches/clocks set to show 10:10?": "2113006", "Atheists, Why only go after Christianity?": "664886", "How do you find your free credit report intantll on line?": "2847618", "if the earth is upside down,how can we live on earth?": "1369513", "Why area ALL americans fat?": "2570513", "how does the tar of a cigarette affect ones health?": "3319679", "Why do Women get mad when I say they belong in the Kitchen?": "606999", "how do you get rid of acne fast?": "3051597", "How can free will co-exist with divine preodrination?": "1877935", "How do I get rid of static shock/electricity?": "3470651", "What is the term \"take hight road\" mean?": "1251077", "why is google more popular than yahoo?": "2076701", "why at the start of evry traffic jam theres a woman driver sat there causing it?": "28306", "why do they put flags in the cemetery?": "3334489", "Why can't the United States consider Homosexuality a first degree felony crime?": "1231907", "what is the difference between a panic or an anxiety attack?": "2839763", "what is the difference between equity and commonlaw?": "540307", "How come Schneb and I always answer the same questions?": "1711914", "how did u find that u re a les?": "639012", "Why is route 66 so popular?": "2300405", "How to distinguish good from evil?": "3075186", "how do i find  help for christmas...?": "2282430", "how did the milkyway get its name?": "3095740", "How does the USA protect freedom from terrorism, when it is practices and supports terrorism in the mid-east?": "435109", "how do i remove the hard water stains off my car windshield?": "3444497", "How do insure 2 cars on 1 policy?": "3946843", "Why is life boring...?": "2938815", "What is the oldest law in History?": "476230", "why are born again chistians such egomaniacal pseudo preachers?": "4031851", "How can I loose about 10 lbs in three weeks?": "187340", "how can i burn some fat?": "4337286", "Why Delaware Companies?": "734105", "how do you buy a massage chair?": "1410748", "how do I become Christian?": "3483686", "What is a great way of making money besides a job?": "4196412", "what is a legume?": "3125922", "Why isn't there a tool to suck up Phlegm in your throat?": "3652886", "what is tempo mantubular joint disorder TMJ?": "3520522", "what is the policy on insurance coverage  of rental vehicles when using mastercard/visa?": "1033328", "How did u realize ur gay?": "2825834", "I just broke a mirror, what do I do?": "3764982", "How are adult stem cells created?": "2965010", "What's the definition of a loser?": "703241", "why does my cat stare at me  ?": "239073", "Why my goldfish staying still at the bottom of the bowl?": "4274155", "Why do stick thin girls always whine about being fat?": "1834079", "Why is the Church so scared of the Da Vinci Code?": "3449078", "how a lesbian could be areal woman?": "3577428", "what is meant by paperback edition?": "3879353", "Why Doesn't Anyone Seem Glad that Saddam Hussein is Finally Being Brought to Justice?": "2877931", "Why do people believe everything that Hollywood says about Witches that is bad?": "3937630", "How do I clean my motorcycle seat that's all gummy and sticky from being in the sun?": "96540", "Why isn't prostitution legal?": "908599", "I'm a black women and don't like hair under arms or private area but always get razor bumps,how can I prevent.": "3152714", "how to make my inner thighs firm ?": "4463410", "Why is it when people cross the street they do not look to see if traffic is coming?": "1051346", "What is a in-e and what is a out-e?": "532098", "How to stop religious War?": "1536755", "How to  be in  engineering  league if  Iam  not a  university  graduate ?": "4287829", "why does the United State have a 3 branches of government?": "4055269", "Why doesn't Jesus protect the altar boys from molestation?": "2645522", "How to Extend the Excitment during *** Mutually?": "2525661", "what is a otter?": "4260897", "What is the condition of bohol, philippines today?": "1374209", "what stores sell odor ban near me?": "1429742", "what were the affects of the Vietnam War?": "4039219", "How and why do bodies decay?": "129619", "how do i join a christian church?": "3884169", "how can you tell the difference between boy and girl fish?": "1218882", "What is the difference between a sunburn and a tan?": "1046895", "How to never have BAD BREATHE ?": "897401", "My fish is twiching why?": "741078", "how can i check the transmition fluid of my 98 Honda prelude?": "120242", "How can I be on the rewalworld show?": "3487494", "How can I get a job contract in usa?": "4041905", "what is the difference between MD and PHD?": "1712669", "How can I stay with my son in Germany, I am american?": "3530959", "What is the meaning of leopold's manuever?": "2205633", "Why do American people put there animals on such a pedestal?": "4032777", "Why have interest rates just gone up?": "4014346", "Electronics: Why do my transistors keep getting HOT?": "514470", "Why do we have to go to school?": "3841009", "What is the bad effect of not having sex regularly?": "1299088", "why do we have to die?": "4369289", "How is the BLACK HOLE creation?": "2282115", "how do I make a slip-n-slide?": "2441094", "Why did Rumsfeld cut 'n run?": "193564", "why do muslims behave like fanatics?": "1663332", "what is shufat?": "2046885", "Why have they taken the word gullible out of the new Oxford dictionary?": "3751495", "How can you tell if a spider bite is serious enough to call the doctor?": "1906047", "Why can't Atheists see?": "633937", "why dont people like sheep?": "1692553", "How do scholarships work  with regards to the money?": "4140440", "what is the standard deviation of the EMC, PIR, ACN, FNM and CVX stocks?": "2845677", "Why is celebrity gossip so addictive?": "3693009", "What is the purpose of the Neutral for the shifting gear?": "501583", "What happens if you dont tell meps about juvenile charges?": "1671734", "why do grils go to the bathroom together?": "657776", "What usefull purposes for vinegar?": "742417", "How can I identitify a prescription pill?": "153146", "How's high school, im so nervous?": "4272061", "what can I do if my son is not returned from visitation with his father when he is suppose to be returned?": "4454835", "why politician at USA most are hypocrite ?": "2619087", "how to prevent toilet bowl smells?": "1815696", "I lost the only set of keys to my car what do i do?": "138140", "How do you tell a stranger that his zipper is down?": "894016", "how do u get a dog for your backround?": "2210196", "i fill boring in the work what i can do to be more effective?": "2325084", "what were the differences between Hoover's and FDR's of handling the Depression?": "1393610", "How to wrap a Ferrero Rocher bouquet?": "885198", "how to get perfect abs?": "827268", "Debt collections, What are my rights?": "337392", "if u r not hungery then why do u eat?": "3489850", "Why isnt  the world getting any better?": "3141572", "Why the hell did Mazada cancel the Milenia?": "1028641", "why do girls get possessed by evil more then boys?": "2023142", "Why do college kids wear Ernesto \"Che\" Guevara shirts?": "2556498", "i'm gay, do u know how can i become stright?": "3579211", "Why do people constantly attack Jews?": "3853590", "What can I do for more energy?": "1387481", "how should a pregnant woman deal with morning sickness?": "4262151", "Why do illegal immigrants get blamed for chaning the national anthem to spanish?": "1855406", "Why doesn't vodka freeze, or if it does, at what temperature?": "1534052", "why did the dems have to run conservatives in order to win?": "3682184", "What is Shakespeare's Hamlet about?": "1978497", "why isnt there a puertorican chat room available?": "255066", "why do I have lower stomache pain?": "18602", "Why isn't something like 'white-holes'?": "2291318", "why do people identify freedom of speech with the possibility to say EVERYTHING?": "3133147", "i dont have any friands on yahoo how do i get some?": "3211282", "How clean is a dogs tongue?": "3061322", "How do we get up early in the morning without alarm?": "4165672", "How to encourage teens to find purpose in life ?": "2551561", "what are the advantages and disadvantages of renting a copier?": "2243553", "Why do people care about racking up the points on Y&A?": "3963608", "why the gases are invisible?": "1878570", "how do you change fractions into word form?": "2500332", "what do we do on easter?": "1115915", "why does the U.S fund Israel?": "1487572", "how do you know if your the antichrist?": "3133097", "Why did God  create us?": "3443765", "why does school start so early?": "966338", "why is water wet?": "2854298", "What is your favorite snack and why?": "3066868", "why is a black hole more black then black ink or black paper?": "3165940", "How do I change chess set figures in Yahoo Chess ?": "3767197", "Why is it a law that we wear helmets/seat-belts to protect ourselves?": "2389242", "What is the meaning of Easter for you?": "2698803", "how can you tell if you cat is pregnant?": "2530659", "why won't a 90' firebird start?": "743628", "What kind of paintings you like more and why?": "3627630", "how can i save my time?": "1344799", "How do I get my mind to focus and not wander?": "3326594", "Why were black women abused sexually after the abolition of slavery in the US in 1865?": "993601", "how did Noah feed all the animals on the Arc while waiting for the flood to recede?": "1259582", "Athiests: How Did You Find The Light?": "4069320", "Why are telescope mirrors made of glass?": "2404311", "how to get rid of stript throat?": "2897078", "why do u need to put thermometr , oxygen stuff and others in fish tank when fishes happily survive in sea?": "2745742", "why are most democrats black?": "2593499", "why are we attracted by art - pictures, paintings, music, sculptures?": "3290417", "How Do I find the hypotenuse?": "136707", "Why womans in India haven't the same Rights as men?": "3652573", "how to keep mice out of my car?": "3411998", "The Moon exactly covers the Sun in an eclipse, Why?": "374022", "HOW is it SOOOOOO bad to live in a TRAILER?": "225204", "What is the high mile club?": "1367015", "what is necrotizing fasciitiis?": "538530", "Why was Unsolved Mysteries suddenly taken off the air when it was doing so well?": "815410", "how come black people an white dont get along?": "886748", "Why do we allow slavery in the United States?": "1637590", "Why don't mormons drink alcohol?": "148970", "What is the difference between a coarse adjustment and a fine adjustment on a microscope?": "4106400", "what happens if a person pop a external hemorrhoid?": "4397223", "When ths USA gets hit, what happens ?": "1749388", "what happened to the term freedom of speech?": "3149170", "why does the earth keep getting hotter and hotter every year?": "1034050", "What are some symptoms of bipolar disorder?": "3905542", "How did African American women get the right to Vote?": "2573745", "Tell me how to make white rice into brown rice?": "373453", "Why did you get out of bed today?": "847561", "how do you get high points on yahoo answer?": "1219786", "How are you feeling today?": "296095", "How do you get rid of the smell of moth balls out of a car?": "157747", "why OSWALD killed KENNEDY?any personal dispute?": "4234146", "What is the basis for creationism?": "902402", "Why does eating chocolate before eating gum cause gum to dissolve when you chew it?": "4207498", "How do you make a root beer float?": "3963399", "why do ducks have so much fat?": "1493026", "why r all of you idiots ?": "4413372", "why are muslims mass-evangelizing nowadays?": "2210131", "See I have lost my voice what do I do?": "4086230"}